{
    "intents": [
        {
            "tag": "bookappointment",
            "patterns": [
                "Hi, I'd like to schedule a routine physical check-up."
            ],
            "responses": [
                "Certainly! I can help you with that. To book your routine physical, could you please provide me with your full name, date of birth, and insurance information?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, I'm trying to reschedule an appointment I have next week."
            ],
            "responses": [
                "I can help with that. Can you please provide your name and the original appointment date and time?"
            ]
        },
        {
            "tag": "cancelappointment",
            "patterns": [
                "I need to cancel an appointment I have."
            ],
            "responses": [
                "I can help with that. Please provide your name and the date and time of the appointment you'd like to cancel."
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I need to get some doctor info"
            ],
            "responses": [
                "Sure! I can help you with that. What is the name of the doctor you are looking for?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I have a question about my bill."
            ],
            "responses": [
                "I'm sorry to hear that. I can assist you. Please provide your name, date of birth, and the account number on the bill."
            ]
        },
        {
            "tag": "emergencycontact",
            "patterns": [
                "I need to get ahold of someone in the event of an emergency."
            ],
            "responses": [
                "Okay, I can help you with that. Are you looking for the hospital's emergency room contact, or are you trying to update your emergency contact information?"
            ]
        },
        {
            "tag": "transfercall",
            "patterns": [
                "Can you transfer me to another department?"
            ],
            "responses": [
                "Certainly. Which department are you trying to reach?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "I wanted to check the status of some results."
            ],
            "responses": [
                "I can help with that. Can you please provide your name and date of birth so I can locate your records?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I moved recently and need to update the information on file."
            ],
            "responses": [
                "I can assist with that. Please provide your name, date of birth, and your new address and phone number."
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I have a question regarding a claim"
            ],
            "responses": [
                "I can look into that for you. Can you provide your name and the claim number?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, I need to reschedule my appointment with Dr. Anya Sharma. My name is Robert Miller, and my patient ID is 789456."
            ],
            "responses": [
                "Okay Mr. Miller, I can help you with that. Could you please confirm your date of birth for verification purposes?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Hi, I'm calling about a bill I received. My name is Maria Rodriguez, and my patient ID is 1234567."
            ],
            "responses": [
                "I understand, Ms. Rodriguez. I can assist you with billing inquiries. Can you provide the account number from the bill in question?"
            ]
        },
        {
            "tag": "labtestbooking",
            "patterns": [
                "Yes, hello, I need to book an appointment to get my bloodwork done. My name is David Lee, and my DOB is May 8th, 1965."
            ],
            "responses": [
                "Okay, Mr. Lee. I can certainly assist you with that. Do you have a doctor's order for the bloodwork, and if so, from which doctor?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Hi there, my name is Susan Jones, and my patient ID is 901234. I need to request a refill for my prescription, please."
            ],
            "responses": [
                "Certainly, Ms. Jones. I can help you with that. Can you please specify which medication you need refilled?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hello, I'm calling to check the status of a report. My name is John Smith, patient ID 567890."
            ],
            "responses": [
                "Okay, Mr. Smith, I can assist you with that. What type of report are you inquiring about?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hi, I need to update my insurance information. My name is Elizabeth Brown, and my patient ID is 345678."
            ],
            "responses": [
                "Okay Ms. Brown, I can certainly help with that. Can you please provide me with your new insurance details?"
            ]
        },
        {
            "tag": "cancelappointment",
            "patterns": [
                "Hi, I am calling to cancel my appointment with Dr. Green. My name is Carl Williams, and my appointment is on November 10th."
            ],
            "responses": [
                "Okay, Mr. Williams. I can help you cancel your appointment. Can you please confirm your date of birth?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "Hello, I need to find out more information about Dr. Ramirez. My name is Patricia Wilson."
            ],
            "responses": [
                "Okay, Ms. Wilson. I can help you with that. What information are you looking for about Dr. Ramirez?"
            ]
        },
        {
            "tag": "referralrequest",
            "patterns": [
                "Hello, I want to see if I can get a referral to another doctor in this hospital."
            ],
            "responses": [
                "Sure, I can do that. Let me pull up your insurance details first. Can you provide your Insurance ID and Patient ID?"
            ]
        },
        {
            "tag": "hospitalnavigation",
            "patterns": [
                "I need assistance navigating the hospital; can you please tell me where Radiology is?"
            ],
            "responses": [
                "Sure, I can help you with that. Do you know which building you are in now?"
            ]
        },
        {
            "tag": "hospitalinfo",
            "patterns": [
                "Can you tell me the visiting hours?"
            ],
            "responses": [
                "Sure, I can help you with that. Which ward are you referring to?"
            ]
        },
        {
            "tag": "complaintfiling",
            "patterns": [
                "I want to file a complaint!"
            ],
            "responses": [
                "I am sorry to hear that. Can I have the details of your complaint?"
            ]
        },
        {
            "tag": "labtestbooking",
            "patterns": [
                "My doctor gave me a lab order to get blood drawn. Can I schedule this?"
            ],
            "responses": [
                "Yes, I can help you schedule that. Which lab do you wish to go to?"
            ]
        },
        {
            "tag": "transportationassistancelookup",
            "patterns": [
                "Hello, I need help with transportation to the hospital. I am patient ID 112233."
            ],
            "responses": [
                "I can certainly help you with that. Do you have a scheduled appointment?"
            ]
        },
        {
            "tag": "financialassistancelookup",
            "patterns": [
                "Hi, I'm calling to inquire about financial assistance for my medical bills. My name is Agnes Moore, patient ID 445566."
            ],
            "responses": [
                "Okay, Ms. Moore, I can guide you on that. Do you have insurance?"
            ]
        },
        {
            "tag": "medicalrecordrequest",
            "patterns": [
                "Hi, I need to get a copy of my medical records. My name is Carol Evans, and my DOB is March 10th, 1970."
            ],
            "responses": [
                "Okay, Ms. Evans, I can help you with that. Do you need the complete record or specific documents?"
            ]
        },
        {
            "tag": "medicationinteractioncheck",
            "patterns": [
                "Hello, I have a question about a medication interaction. I am patient ID 223344."
            ],
            "responses": [
                "Okay, I can assist you with that. Can you please provide the names of the medications you are concerned about?"
            ]
        },
        {
            "tag": "vaccinationschedulelookup",
            "patterns": [
                "Hello, I need information about... vaccines for my son?"
            ],
            "responses": [
                "Hello! I understand. You need information about vaccines for your son. Could you please provide the child's name and date of birth?"
            ]
        },
        {
            "tag": "vaccinesideeffectsinfo",
            "patterns": [
                "About the vaccines... do they cause side effects? I'm a little worried."
            ],
            "responses": [
                "I understand your concern. It's important to be informed about potential side effects. Which vaccine in particular are you concerned about?"
            ]
        },
        {
            "tag": "languageinterpretation",
            "patterns": [
                "Es difícil para mí entender todo esto en inglés. ¿Pueden ayudarme en español? (It's difficult for me to understand all this in English. Can you help me in Spanish?)"
            ],
            "responses": [
                "Absolutamente. Podemos ofrecerle asistencia en español. ¿Cómo puedo ayudarle específicamente? (Absolutely. We can provide you with assistance in Spanish. How can I specifically help you?)"
            ]
        },
        {
            "tag": "patientinfolookup",
            "patterns": [
                "Hola, quisiera saber cuándo le toca la próxima vacuna a mi hija.  Se llama Sofia Perez y nació el 2 de julio de 2020. (Hello, I would like to know when my daughter's next vaccine is due. Her name is Sofia Perez and she was born on July 2, 2020.)"
            ],
            "responses": [
                "Entiendo. Necesito verificar su información. ¿Podría proporcionarme su número de seguro o número de identificación de paciente? (I understand. I need to verify your information. Could you provide me with your insurance number or patient identification number?)"
            ]
        },
        {
            "tag": "emergencycontact",
            "patterns": [
                "¿Qué pasa si mi hijo tiene una reacción alérgica a la vacuna? (What happens if my son has an allergic reaction to the vaccine?)"
            ],
            "responses": [
                "Es una pregunta importante. Las reacciones alérgicas graves a las vacunas son raras, pero es importante estar preparado. ¿Le preocupa alguna vacuna en particular? (That's an important question. Severe allergic reactions to vaccines are rare, but it's important to be prepared. Are you concerned about a specific vaccine?)"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hi, I'm calling to check on the status of a COVID-19 PCR test I took two days ago.  I really need the results quickly for travel purposes."
            ],
            "responses": [
                "Certainly, I can help you with that. To locate your test, can you please provide the lab order number and your insurance information?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hello, I'm trying to find out if my COVID test results are ready. I had a PCR test done on Tuesday."
            ],
            "responses": [
                "I can help you check that. Can you provide the lab order number or your date of birth and full name for verification?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hi, I need to know when my COVID test will be ready. It's been almost three days."
            ],
            "responses": [
                "I understand your concern. Let me check the status for you. Can you please provide your lab requisition number or patient ID?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Good morning, I'm calling to get the results of a COVID test I had done. I need them urgently."
            ],
            "responses": [
                "Good morning! I can assist you with that. Could you please give me the lab order number or your full name and date of birth so I can access the information?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "I am calling because I haven't received my COVID test results yet and it's been 48 hours. Can you please help?"
            ],
            "responses": [
                "Certainly, I can help you check the status of your test. To begin, could you provide the lab order number or your full name and date of birth?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hi, I need an update on my COVID PCR test. I had it done on Monday morning."
            ],
            "responses": [
                "I can certainly look into that for you. Please provide either the lab order number or your date of birth and full name."
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hello, I took a COVID test and was wondering if the results are ready. It's been two days."
            ],
            "responses": [
                "Hello, I can help you with that. Could you please provide your lab requisition number or your full name and date of birth for verification?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "I had a COVID test done and need to know when I can expect the results."
            ],
            "responses": [
                "I can help with that! Can you provide the lab order number or your first name, last name, and date of birth please?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hi, I'm just calling to check on my PCR test. It's been over 48 hours and I need it ASAP."
            ],
            "responses": [
                "I understand, I can help with that. Can you give me your lab order number, or your name and date of birth please?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hello, I had a COVID-19 PCR test done a couple of days ago. I was wondering if the result is available."
            ],
            "responses": [
                "Hi there. I can check that for you. Could you please provide the lab order number or your date of birth and full name?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hello, I had surgery last month, and I need help to get money back from insurance, but I'm not sure how to do."
            ],
            "responses": [
                "Hello! I understand you're seeking reimbursement for your recent surgery. I can definitely help you with your insurance claim. Could you please provide your patient ID and insurance information?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Excuse me, I want to ask about my hospital bill. I don't understand."
            ],
            "responses": [
                "I understand you have questions about your hospital bill. I can assist you with that. Can you please provide your patient ID?"
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "Hello, I want to book doctor see. For my daughter. She has the fever, you know."
            ],
            "responses": [
                "Hello. I understand you want to book an appointment for your daughter because she has a fever. I can certainly help with that. What is your daughter's name and date of birth?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Hi, I need to get some medication again. I finish my pills."
            ],
            "responses": [
                "Hello. I understand you need a refill of your medication. I can help with that. Can you please provide your patient ID and the name of the medication?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hello, I have results from the lab. How can I see them?"
            ],
            "responses": [
                "Hello. I understand you'd like to check your lab results. I can help you access those. Could you please provide your patient ID?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Hi, I need to talk with someone about my bill. I think there is a mistake."
            ],
            "responses": [
                "Hello, I understand you believe there is a mistake on your bill. I can help you with that. Please provide your patient ID and the account number of the bill in question."
            ]
        },
        {
            "tag": "labtestbooking",
            "patterns": [
                "Hello, my doctor wants me to make appointment for the blood test. How I do?"
            ],
            "responses": [
                "Hello. I understand your doctor wants you to schedule a blood test. I can certainly help you with that. Do you have a specific order or form from your doctor?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello, I moved. I need to change my address with the hospital."
            ],
            "responses": [
                "Hello. I understand you need to update your address. I can help with that. Can you please provide your patient ID and your new address?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hello, I lost my insurance card. Can you find my insurance info?"
            ],
            "responses": [
                "Hello. I understand you lost your insurance card, and you need help finding your insurance information. I can assist you with that. Please provide your patient ID and date of birth."
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, I cannot come to the doctor tomorrow. I need to change the appointment."
            ],
            "responses": [
                "Hello. I understand you need to reschedule your appointment. I can certainly help you with that. Can you please provide your patient ID and the date of your current appointment?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Hi, I'm totally out of my insulin. Like, completely gone. I need a refill ASAP!"
            ],
            "responses": [
                "I understand this is urgent.  To help me process your refill request quickly, can you please provide your full name, date of birth, and patient ID, if you have it?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Excuse me, I need a prescription refill, and it's pretty urgent. I am out of insulin already."
            ],
            "responses": [
                "I understand your concern. I can certainly assist with that. Please provide me with your name, date of birth, and patient ID so I can look up your prescription."
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need to get my prescription refilled right away. I'm completely out of my meds, and it's important."
            ],
            "responses": [
                "I understand the urgency. Let's get this sorted out. Could you please provide your name, date of birth, and patient ID number?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Help! I ran out of my insulin. Can someone please refill my prescription immediately?"
            ],
            "responses": [
                "I can help with that. To expedite the refill process, please provide your full name, date of birth, and patient ID."
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I am calling because I need my insulin prescription refilled right away! I forgot to order it and now I have nothing left."
            ],
            "responses": [
                "I understand you need your insulin refilled urgently. I'll do my best to help. Can you provide your full name, date of birth, and patient ID number, please?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello? Can you hear me? Need to change emergency contact."
            ],
            "responses": [
                "Hello! I understand you need to update your emergency contact. Can you please provide your full name and date of birth for verification?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Help! Need to change my contact for emergencies. Can't hear well, so typing is best."
            ],
            "responses": [
                "Certainly! I can assist you with that. To start, could you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello, I need to change my emergency contact. Text is best for me."
            ],
            "responses": [
                "Hello! I understand. I will gladly help you update your emergency contact information. May I have your full name and date of birth to verify your identity, please?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I want a new emergency person. Hard of hearing, text okay?"
            ],
            "responses": [
                "Yes, text is perfect. Thank you for letting me know. To proceed, please provide your full name and date of birth."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hi. Update emergency contact. I can read ok. Typing slow"
            ],
            "responses": [
                "Hello! No problem at all. We can take our time. To begin, can you please provide your full name and date of birth for verification?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello, need to change who to call if something happens. I am hard of hearing."
            ],
            "responses": [
                "Hello, I understand. I can certainly assist you with updating your emergency contact information. First, could you please provide your full name and date of birth for verification?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Help. Emergency contact update. Text only please."
            ],
            "responses": [
                "Of course! I can help with that via text. Could you please provide your full name and date of birth?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello. Need to change emergency contact. Hearing problems, text only."
            ],
            "responses": [
                "Hello! I can certainly help you with that through text. Can you please provide your full name and date of birth for verification?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Need to change emergency contact info. Hard to hear, texting is best."
            ],
            "responses": [
                "Understood. We'll communicate via text. Please provide your full name and date of birth to verify your identity."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello, need to change emergency contact person. Can't hear well, text is good."
            ],
            "responses": [
                "Hello. I will assist you with that through text. To begin, can you please provide your full name and date of birth?"
            ]
        },
        {
            "tag": "mentalhealthsupportlookup",
            "patterns": [
                "Hi, I'm feeling incredibly anxious lately and it's affecting my daily life. I'd like to explore mental health support options you have available."
            ],
            "responses": [
                "I understand you're experiencing anxiety and looking for support. I'm here to help. To best assist you, could you provide your name and date of birth?"
            ]
        },
        {
            "tag": "mentalhealthsupportlookup",
            "patterns": [
                "Hi, I'm calling because I've been having trouble sleeping and feeling overwhelmed.  I think I need to talk to someone about it."
            ],
            "responses": [
                "I'm sorry to hear that you're struggling.  We can definitely help you explore some options. Could you please provide your medical record number or date of birth so I can access your information?"
            ]
        },
        {
            "tag": "therapistgenderfilter",
            "patterns": [
                "Hello, I'm calling to inquire about mental health services. I'm struggling with anxiety and would prefer to speak with a female therapist if possible."
            ],
            "responses": [
                "Thank you for reaching out. I understand you're seeking mental health services and prefer a female therapist. To proceed, can you please provide your name and insurance information?"
            ]
        },
        {
            "tag": "therapistgenderfilter",
            "patterns": [
                "Hi, I'm calling to see what mental health resources you have. I've been feeling really anxious and panicky lately, and I'd like to find a therapist. Ideally, a female one."
            ],
            "responses": [
                "I'm sorry to hear you're experiencing anxiety and panic. I can definitely help you explore your options. Could I please get your name and date of birth to access your records?"
            ]
        },
        {
            "tag": "insurancecoveragecheck",
            "patterns": [
                "Hello, I'm interested in learning about mental health services for anxiety. I would prefer a female therapist if possible."
            ],
            "responses": [
                "I understand you're looking for mental health services for anxiety and prefer a female therapist. To best assist you, could you please provide your full name and insurance provider?"
            ]
        },
        {
            "tag": "disputecharge",
            "patterns": [
                "Hey, I got this bill from you guys, and it's got a charge for a lab test I never had. Says it was for some fancy blood work, but I never even saw a needle. What gives?"
            ],
            "responses": [
                "I understand you're disputing a charge on your recent bill. Could you please provide your patient ID and date of birth so I can access your account?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "Hi, I recently moved here and need to transfer my medical records from my old hospital. Can you help me with that?"
            ],
            "responses": [
                "Welcome to our hospital! I can certainly assist you with transferring your medical records. To get started, can you please provide me with your name, date of birth, and the name and location of your previous hospital?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "I need to get my records transferred over here. I just moved from out of state."
            ],
            "responses": [
                "I can certainly help you with that. What is your name and date of birth, please? And also, the name of the hospital and city that you previously used?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "Hello, I want to transfer my records from my old doctor to this hospital."
            ],
            "responses": [
                "Certainly! I can help with the transfer. What is your full name, date of birth, and the name and address of your previous doctor's office, including city and state?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "Hi, I need to get my medical history sent over here. I've just moved to town."
            ],
            "responses": [
                "Of course, I can assist with that. Can you please provide your full name, date of birth, and the name and location of your previous healthcare provider?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "Hello, I am calling to get my health records transferred from my old place. I'm new here."
            ],
            "responses": [
                "Hello! I can help you with that. First, can I please get your full name, date of birth, and the name and address of the hospital or clinic you're transferring from?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "Hi there! I need to arrange to have my medical records moved over to this hospital from my previous provider."
            ],
            "responses": [
                "Hello! Happy to help with that. Could you please provide your full name, date of birth, and the name and location of the previous provider?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "I've recently moved and need to get my records sent here from my old doctor's office."
            ],
            "responses": [
                "I can certainly assist you with that. Could you please provide your full name, date of birth, and the name and address of your previous doctor's office?"
            ]
        },
        {
            "tag": "telehealthavailability",
            "patterns": [
                "Hi, I'd like to know if you offer virtual doctor visits. I think I have the flu."
            ],
            "responses": [
                "Certainly! We do offer virtual consultations. To best assist you, can I get your name and date of birth?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Hello, I'm calling to inquire about my recent bill."
            ],
            "responses": [
                "I can help with that! To get started, could you please provide your name, date of birth, and the account number associated with the bill?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule an appointment I have next week."
            ],
            "responses": [
                "I can assist with that. Can I get your name, date of birth, and the date and time of the appointment you'd like to reschedule?"
            ]
        },
        {
            "tag": "transfercall",
            "patterns": [
                "I'm trying to find out the contact information for the cardiology department."
            ],
            "responses": [
                "Certainly! To best direct your call, are you a current patient of the cardiology department?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need to get a refill on my prescription."
            ],
            "responses": [
                "Okay, I can help with that. Can I have your name, date of birth, and the name of the medication?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "I'd like to know if my lab results are ready."
            ],
            "responses": [
                "I can check that for you. Can I please have your name and date of birth?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to update my insurance information."
            ],
            "responses": [
                "I can help you with that. Can I get your name, date of birth, and the new insurance information?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I want to know if a specific doctor is accepting new patients."
            ],
            "responses": [
                "I can certainly help with that. Can you provide the doctor's name and specialty?"
            ]
        },
        {
            "tag": "emergencycontact",
            "patterns": [
                "I need the emergency contact number for the hospital."
            ],
            "responses": [
                "I understand. For what kind of emergency do you need the number?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I am trying to find a specialist in gastroenterology."
            ],
            "responses": [
                "Certainly! I can help you find a gastroenterologist. Do you have any preferences, such as location or a specific insurance provider?"
            ]
        },
        {
            "tag": "checkwoundcareinstructions",
            "patterns": [
                "Hello, I was just discharged and I'm a little confused about what I need to do for my wound care at home. Can you help?"
            ],
            "responses": [
                "Certainly! I can assist you with that. To help me locate your information, could you please provide your patient ID and date of birth?"
            ]
        },
        {
            "tag": "checkappointment",
            "patterns": [
                "Hi, I need information about my upcoming surgery. When is it scheduled for?"
            ],
            "responses": [
                "Hello, I can help with that. Could you please provide your medical record number or date of birth to locate your records?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Good morning. I'm calling about a bill I received. I think there might be an error."
            ],
            "responses": [
                "Good morning. I can definitely help you with that. Can you please provide your account number or the patient's name and date of birth?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Hi, I need to refill my prescription. It's for my blood pressure."
            ],
            "responses": [
                "Hello! I can assist you with that. To locate your prescription information, can you please provide your patient ID or date of birth?"
            ]
        },
        {
            "tag": "transfercall",
            "patterns": [
                "I need to speak to someone in the Cardiology department ASAP."
            ],
            "responses": [
                "I understand. To best direct your call, are you a patient, or are you calling about a patient?"
            ]
        },
        {
            "tag": "cancelappointment",
            "patterns": [
                "I need to cancel my appointment with Dr. Lee for next week."
            ],
            "responses": [
                "Okay, I can help you with that. Can you please provide your name and date of birth to locate your appointment?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hi, I'm calling to get the results of my recent blood test."
            ],
            "responses": [
                "Hello! I can help you with that. To access your test results, can you please provide your patient ID or date of birth?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I recently moved. How do I update my address in your system?"
            ],
            "responses": [
                "I can help you update your address. Could you please provide your patient ID and your new address?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I have a question about my insurance claim. It's been pending for a while."
            ],
            "responses": [
                "I can help you look into that. Can you please provide your insurance policy number and the date of service in question?"
            ]
        },
        {
            "tag": "labtestbooking",
            "patterns": [
                "I need to schedule a lab test for my cholesterol. My doctor gave me the order."
            ],
            "responses": [
                "Okay, I can help you schedule that. Do you have the order with you? And can you provide your name and date of birth for verification?"
            ]
        },
        {
            "tag": "checkwoundcareinstructions",
            "patterns": [
                "My mother just got discharged and needs wound care. Where can she get supplies delivered to her home?"
            ],
            "responses": [
                "I can assist you with that. Could you please provide her patient ID and date of birth?"
            ]
        },
        {
            "tag": "travelclearanceinfo",
            "patterns": [
                "Hello, I need some information about travel clearance for my child. He has asthma, and we're planning a trip out of state."
            ],
            "responses": [
                "I understand. I can help you with that. To ensure I provide accurate information, could you please provide your child's medical record number or date of birth?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule my appointment with Dr. Ramirez. I have a conflict that came up."
            ],
            "responses": [
                "I can help with that. Could you please provide your full name and date of birth to locate your appointment?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "My bill seems really high this month. I wanted to understand the charges better."
            ],
            "responses": [
                "I can certainly assist you with that. To access your billing information securely, could you please provide your account number or the patient's full name and date of birth?"
            ]
        },
        {
            "tag": "labtestbooking",
            "patterns": [
                "I need to book a lab test. My doctor ordered a complete blood count."
            ],
            "responses": [
                "Okay, I can help you schedule that. Do you have the order from your doctor handy, or can you provide me with your name and date of birth to look it up in our system?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I'm trying to get a refill on my prescription. It's for my blood pressure medication."
            ],
            "responses": [
                "I can assist you with that. To process the refill, could you please provide the prescription number or your name and date of birth?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to update my insurance information. I just switched plans."
            ],
            "responses": [
                "I can help you with that. Please have your new insurance card ready. To begin, can you provide your name and date of birth?"
            ]
        },
        {
            "tag": "departmentdirectory",
            "patterns": [
                "I need the contact information for the cardiology department."
            ],
            "responses": [
                "I can definitely provide that for you. Is there a specific doctor or purpose for your call?"
            ]
        },
        {
            "tag": "referralstatus",
            "patterns": [
                "I have a question about a referral I received."
            ],
            "responses": [
                "I can look into that for you. To access your referral information, can I please have your name and date of birth?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to report a change of address."
            ],
            "responses": [
                "Okay, I can help you update your address. To verify your identity, could you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "I want to check the status of my lab report results."
            ],
            "responses": [
                "I can help you with that. Could you please provide your full name and date of birth to locate your records?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I need to find a specialist for a rare condition."
            ],
            "responses": [
                "I understand. To assist you in finding the right specialist, could you please provide the name of the condition or describe the symptoms?"
            ]
        },
        {
            "tag": "symptomchecker",
            "patterns": [
                "My son has a fever and cough. I'm not sure if I should bring him in."
            ],
            "responses": [
                "I understand your concern. To help me assess the situation, can you please tell me your son's age and temperature, and any other symptoms he's experiencing?"
            ]
        },
        {
            "tag": "cancelappointment",
            "patterns": [
                "I need to cancel an upcoming surgery."
            ],
            "responses": [
                "I'm sorry to hear you need to cancel your surgery. To process your cancellation, could you please provide your name, date of birth, and the date of your scheduled surgery?"
            ]
        },
        {
            "tag": "medicalterminologyguide",
            "patterns": [
                "I am having trouble understanding the medical jargon in my report."
            ],
            "responses": [
                "I understand. Medical reports can be complex. I can help you with that. Could you please provide your name and date of birth so I can access the report?"
            ]
        },
        {
            "tag": "errorreporting",
            "patterns": [
                "I believe there's an error in my medical record."
            ],
            "responses": [
                "I understand your concern. To investigate this further, could you please provide your name, date of birth, and a brief description of the error you've identified?"
            ]
        },
        {
            "tag": "patientrightsinfo",
            "patterns": [
                "I have questions about my privacy rights as a patient."
            ],
            "responses": [
                "I can certainly address your concerns. What specific aspects of your privacy rights are you curious about?"
            ]
        },
        {
            "tag": "financialassistanceinfo",
            "patterns": [
                "I am looking for information on financial assistance programs."
            ],
            "responses": [
                "I can help you with that. Do you have an account number or patient ID I can use to access your information, or should I find you by your name and date of birth?"
            ]
        },
        {
            "tag": "nearesturgentcare",
            "patterns": [
                "Where is the nearest walk-in clinic?"
            ],
            "responses": [
                "I can locate that for you. Could you please provide your current address or zip code?"
            ]
        },
        {
            "tag": "emergencycontact",
            "patterns": [
                "I am experiencing chest pain."
            ],
            "responses": [
                "I understand. Chest pain can be a serious issue. Is the pain severe, and are you experiencing any other symptoms like shortness of breath or dizziness?"
            ]
        },
        {
            "tag": "patientportalsupport",
            "patterns": [
                "I have been having issues using the patient portal."
            ],
            "responses": [
                "I can help you with that. What issues are you experiencing specifically?"
            ]
        },
        {
            "tag": "officehourslookup",
            "patterns": [
                "I need to find out what time my doctor's office closes."
            ],
            "responses": [
                "I can definitely help you find that information. What is the name of your doctor or the department you are trying to contact?"
            ]
        },
        {
            "tag": "legalnamechange",
            "patterns": [
                "Hi, I'm calling to inquire about updating my legal name and gender on my medical records. I recently completed my legal transition."
            ],
            "responses": [
                "Thank you for calling. I can certainly assist you with that. To proceed, could you please provide your patient ID or date of birth?"
            ]
        },
        {
            "tag": "gendermarkerupdate",
            "patterns": [
                "Hello, I'm calling to inquire about updating my legal name and gender on my medical records. I've legally changed my name and gender."
            ],
            "responses": [
                "Thank you for calling. I can assist with updating your legal name and gender on your medical records. Could you please provide your patient ID and date of birth for verification?"
            ]
        },
        {
            "tag": "documentupload",
            "patterns": [
                "Hi, I need to change my name and gender on my records here. I've got all the court papers and everything."
            ],
            "responses": [
                "Hello, I understand you'd like to update your name and gender on your records. To begin, could you please provide your patient identification number?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I'd like to change my legal name and gender in your system. How do I do that?"
            ],
            "responses": [
                "Certainly, I can guide you through that process. To begin, can I get your full name and date of birth to locate your record?"
            ]
        },
        {
            "tag": "confidentialitypolicylookup",
            "patterns": [
                "Hi, I want to make sure my records reflect my correct name and gender. I recently had them legally changed."
            ],
            "responses": [
                "I can definitely assist you with that. To start, may I please have your patient ID and current legal name?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, good morning. I need to change my physical therapy appointment. I don’t speak much English, so please, slowly. I want a female therapist and I need transportation — I can't drive."
            ],
            "responses": [
                "Good morning. I understand that you want to change your physical therapy appointment, you prefer a female therapist, and you need transportation. To assist you better, could you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule my appointment. I'm having some serious car trouble, and I just can't make it."
            ],
            "responses": [
                "I understand you need to reschedule your appointment due to car trouble. Could you please provide your name and the date of your appointment?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to change my physical therapy appointment. My daughter will be in town that day and I want to spend some time with her."
            ],
            "responses": [
                "Certainly! I can help you reschedule your physical therapy appointment. Can I please get your full name and date of birth to locate your appointment?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I'm calling to ask if it's possible to switch my appointment. Something came up unexpectedly."
            ],
            "responses": [
                "I understand you need to reschedule your appointment. To assist you, could you provide your name and date of birth, please?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule my appointment. It conflicts with a pre-planned travel event."
            ],
            "responses": [
                "I understand you'd like to reschedule. To assist you, I will need your full name and date of birth."
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "Hi, I'd like to schedule a routine physical exam."
            ],
            "responses": [
                "Okay, I can help with that. Are you a new or existing patient?"
            ]
        },
        {
            "tag": "cancelappointment",
            "patterns": [
                "Hello, I need to cancel my appointment with Dr. Smith on Tuesday."
            ],
            "responses": [
                "I understand. Can you please confirm your name and date of birth?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I received a bill that seems incorrect. I was charged for something I don't think I had."
            ],
            "responses": [
                "I'm sorry to hear that. Can you please provide your account number and date of service?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule my appointment with Dr. Lee. Something came up."
            ],
            "responses": [
                "Certainly. Can you provide me with your name and the date of your current appointment?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I'm trying to find a doctor who specializes in cardiology."
            ],
            "responses": [
                "Okay, I can help with that. Do you have any specific requirements, such as location or insurance?"
            ]
        },
        {
            "tag": "emergencycontact",
            "patterns": [
                "What's the phone number for the emergency room?"
            ],
            "responses": [
                "Are you experiencing an emergency right now?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "I had some lab work done last week and I'm wondering if the results are in yet."
            ],
            "responses": [
                "I can check on that for you. Can you provide your name and date of birth?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I moved recently and need to update my address in your system."
            ],
            "responses": [
                "Certainly. I can help you with that. Can you please provide your full name and date of birth?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I have a question about my insurance claim."
            ],
            "responses": [
                "I understand. Can you please provide your name, insurance provider, and policy number?"
            ]
        },
        {
            "tag": "labtestbooking",
            "patterns": [
                "I need to schedule a lab test."
            ],
            "responses": [
                "Okay, I can help with that. What kind of lab test are you needing to schedule?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need a refill of my prescription."
            ],
            "responses": [
                "Okay, I can help you with that. Can you please provide your name and the name of the medication?"
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "I want to book an appointment for a routine physical check-up."
            ],
            "responses": [
                "Okay, I can help you with that. Are you a new or existing patient?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, I need to reschedule my appointment with Dr. Ramirez. My name is Earl Johnson, and my patient ID is 47B92."
            ],
            "responses": [
                "Good morning, Mr. Johnson. I can certainly help you with that. Could you please provide me with the date and time of your current appointment with Dr. Ramirez?"
            ]
        },
        {
            "tag": "cancelappointment",
            "patterns": [
                "I need to cancel an appointment. Name's Martha Peterson, ID is 12A56. It's with Dr. Lee."
            ],
            "responses": [
                "Okay, Mrs. Peterson. I can assist you with canceling your appointment with Dr. Lee. Can you verify the date and time of the appointment you want to cancel?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "I need to check on the status of a report. My name is George Higgins, and my patient ID is 91C78."
            ],
            "responses": [
                "Good afternoon, Mr. Higgins. I can help you check the status of your report. Can you tell me what kind of report you are referring to? For example, a lab report, or radiology report?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need a refill on my prescription. My name is Helen Miller. Patient ID is 63D41."
            ],
            "responses": [
                "Good morning, Mrs. Miller. I can assist you with a prescription refill. Can you please tell me which medication you need refilled?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to update my address. My name is Robert Smith. Patient ID is 29E85."
            ],
            "responses": [
                "Good afternoon, Mr. Smith. I can help you with that. What is your new address?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I need to find a specialist. My name is Alice Brown. Patient ID is 75F19."
            ],
            "responses": [
                "Okay, Mrs. Brown. What kind of specialist are you looking for?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I have a question about my bill. My name is David Wilson. Patient ID is 31G62."
            ],
            "responses": [
                "Good evening, Mr. Wilson. I can help you with billing questions. Can you please provide the account number or date of service in question?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I want to book an appointment with a new doctor. My name is Susan Davis. Patient ID is 87H35."
            ],
            "responses": [
                "Okay, Ms. Davis, I can help you with booking an appointment. What type of doctor are you looking for, and do you have a specific doctor in mind?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to find out the emergency contact information. My name is Karen White. Patient ID is 44I79."
            ],
            "responses": [
                "Okay, Mrs. White. Are you looking for the emergency contact information *on file* for you, or are you trying to update your emergency contact?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Can I speak to someone about an insurance claim? My name is Thomas Green. Patient ID is 18J26."
            ],
            "responses": [
                "Certainly, Mr. Green. I can assist you with insurance claim questions. Do you have the claim number available?"
            ]
        },
        {
            "tag": "pediatricvaccinationschedulelookup",
            "patterns": [
                "Hello, I need information about vaccines for my son. He is five years old."
            ],
            "responses": [
                "Hello! I understand. I can help you with that. To better assist you, could you please provide your child's name and date of birth?"
            ]
        },
        {
            "tag": "pediatricvaccinationschedulelookup",
            "patterns": [
                "Excuse me, I need to know when my little girl is due for her next vaccine."
            ],
            "responses": [
                "I understand. To help you, I need your daughter's name and date of birth."
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "Good afternoon, I want to know if my son can get the flu vaccine now."
            ],
            "responses": [
                "Good afternoon. Yes, the flu vaccine is available. Can you give me your son's name and date of birth?"
            ]
        },
        {
            "tag": "pediatricvaccinationschedulelookup",
            "patterns": [
                "Hello, my son needs the MMR vaccine, how can I get him vaccinated?"
            ],
            "responses": [
                "Hello. I understand. To help, I need your child's name and date of birth."
            ]
        },
        {
            "tag": "cliniclocator",
            "patterns": [
                "Hello, my daughter needs the measles vaccine and I don't know where to take her."
            ],
            "responses": [
                "Buenas. Entiendo. (Hello. I understand.) I can definitely help you with that. Can you provide your daughter's name and date of birth, please?"
            ]
        },
        {
            "tag": "covidvaccineinfo",
            "patterns": [
                "I would like to know if it is necessary to vaccinate my son against COVID."
            ],
            "responses": [
                "I understand your request. To answer this, can you give me your son's name and date of birth?"
            ]
        },
        {
            "tag": "travelvaccinerecommendations",
            "patterns": [
                "I need to know if my daughter needs any vaccines to travel to Mexico."
            ],
            "responses": [
                "I understand. To assist you, can you please provide your daughter's name and date of birth?"
            ]
        },
        {
            "tag": "pediatricvaccinationschedulelookup",
            "patterns": [
                "Mi hijo tiene 6 años y no sé si tiene todas las vacunas. (My son is 6 years old and I don't know if he has all the vaccines.)"
            ],
            "responses": [
                "Entiendo. (I understand.) Can you provide his name and date of birth?"
            ]
        },
        {
            "tag": "vaccinesideeffectsinfo",
            "patterns": [
                "Hola, estoy preocupada porque mi hija tuvo fiebre después de la vacuna. (Hello, I'm worried because my daughter had a fever after the vaccine.)"
            ],
            "responses": [
                "Hola, lamento escuchar eso. (Hello, I'm sorry to hear that.) Can you please tell me her name and date of birth?"
            ]
        },
        {
            "tag": "schoolvaccinerequirements",
            "patterns": [
                "Necesito saber si la vacuna contra la varicela es obligatoria para entrar al colegio. (I need to know if the chickenpox vaccine is mandatory to enter school.)"
            ],
            "responses": [
                "Entiendo. (I understand.) To check, can you provide the state you live in and the child's name and birthdate?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hi, I'm calling to check on the status of a COVID-19 PCR test I took a couple of days ago. I need the result urgently."
            ],
            "responses": [
                "Okay, I can help with that. To locate your test results, could you please provide the lab order number and your insurance information?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hello, I'm calling about my COVID test. I had one done a couple of days back and I want to know when will I get the report?"
            ],
            "responses": [
                "I can help you check on the status of your COVID test report. To proceed, could you please provide your lab order number and your insurance details?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hi, I'm calling to inquire about my Covid test. I need it for something very important."
            ],
            "responses": [
                "Okay, I understand you're calling to check on the status of your COVID-19 test. Can you provide your lab order number and insurance details?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Yeah, I'm calling to, uh, check on a COVID test? I took it, like, two days ago, maybe?"
            ],
            "responses": [
                "Okay, I can help you with that. Could you please provide your lab order number and insurance information to help me locate your test?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Good morning, I'm calling to follow up on a COVID-19 PCR test that I underwent. I would appreciate it if you could check on it for me. It's rather pressing."
            ],
            "responses": [
                "Good morning, certainly! I can assist you with checking the status of your test. To do so, could you please provide the lab order number and your insurance information?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hello. I am calling to check on my COVID PCR test. I did it two days ago and need to know if it's available."
            ],
            "responses": [
                "Hello, I can help with that. To access your test result, could you please give me the lab order number along with your insurance details?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hello, I need some... how you say... help with my insurance claim. I had operation, very expensive."
            ],
            "responses": [
                "Certainly, I can assist you with your insurance claim. To start, could you please provide your patient ID and insurance policy number?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Yes, I need some... how you say... help with my insurance claim. My wife had operation, very expensive."
            ],
            "responses": [
                "I understand. I can help you with your wife's insurance claim. Could you please provide your wife's patient ID and your insurance policy number?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hello, I need assistance to claim my reimbursement, please. I underwent surgery recently."
            ],
            "responses": [
                "Certainly, I can assist you with the reimbursement claim for your recent surgery. To begin, can you please provide your patient identification number and insurance policy details?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hello, I am calling about a reimbursement claim. I had a surgery. Is very confusing for me."
            ],
            "responses": [
                "I understand it can be confusing. I can help you with your reimbursement claim. Can you please provide your patient ID and insurance number?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hi. I need help with... insurance thing. For my surgery, please."
            ],
            "responses": [
                "Hello, I can help you with your insurance claim related to the surgery. Could you please provide your patient ID and insurance policy number?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hello. I need help... insurance claim... surgery... very difficult."
            ],
            "responses": [
                "I understand it can be difficult. I'm here to help you with your insurance claim for your surgery. Can I get your patient ID and insurance policy number?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hi, I'm calling about the insurance claim for my surgery. I need help with the documents."
            ],
            "responses": [
                "Hello, I can certainly help you with your insurance claim documents. To get started, can you please provide your patient ID and your insurance policy number?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hello, I'm calling about an insurance claim. I got a surgery and need help submitting the documents."
            ],
            "responses": [
                "Hello, I can assist you with submitting the documents for your surgery claim. Please provide me with your patient ID and your insurance policy number."
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hi, I need assistance with reimbursement form... for surgery. I don't understand."
            ],
            "responses": [
                "Hello, I can certainly help you with your reimbursement form. Please provide your patient ID and your insurance policy number."
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hello, I am calling about reimbursement for my surgery. The online process is confusing."
            ],
            "responses": [
                "Hello, I understand the online process can be confusing. I can assist you with your reimbursement claim. First, can you give me your patient ID and insurance policy number?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Hi, I'm out of my insulin and I need a refill ASAP! I'm really worried."
            ],
            "responses": [
                "I understand this is urgent. Can you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Hello. I think I need to refill my insulin prescription."
            ],
            "responses": [
                "I can help with that. Could you please provide your full name and date of birth so I can locate your record?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "My daughter needs her insulin refilled. She says she is almost out."
            ],
            "responses": [
                "I understand. To assist, I'll need your daughter's full name and date of birth."
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need insulin. Like, now! I'm a diabetic."
            ],
            "responses": [
                "I understand this is urgent.  To proceed with the refill, I need some information to locate your records. Can you provide your name and date of birth?"
            ]
        },
        {
            "tag": "emergencycontact",
            "patterns": [
                "I am nearly out of my insulin and my blood sugar is high.  This is an emergency."
            ],
            "responses": [
                "I understand the urgency. Can you confirm your name and date of birth, and location?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello, I need to change my emergency contact. It's urgent."
            ],
            "responses": [
                "Hello. I can help you with that. To update your emergency contact information, I'll need to verify your identity first. Can you provide your patient ID and date of birth?"
            ]
        },
        {
            "tag": "confirmupdate",
            "patterns": [
                "Yes, that's correct. Please confirm when the change is complete."
            ],
            "responses": [
                "Understood. I'll process the update and let you know as soon as it's confirmed."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to change the contact number on my file for emergencies."
            ],
            "responses": [
                "I understand. To proceed, can you please provide me with your patient ID and date of birth for verification?"
            ]
        },
        {
            "tag": "confirmupdate",
            "patterns": [
                "Yes, correct. Please confirm once changed."
            ],
            "responses": [
                "Alright. I will make the change and confirm once it's updated in our system."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello, changing emergency contact info."
            ],
            "responses": [
                "Hello. I can assist with this. Can you give me your patient ID and birthdate?"
            ]
        },
        {
            "tag": "confirmupdate",
            "patterns": [
                "Yes, that is correct. Please let me know when it's finalized."
            ],
            "responses": [
                "Certainly. I will confirm once the update has been made."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Need update emergency contact. Hard to hear on phone."
            ],
            "responses": [
                "I understand. We can do that through text. First, please provide your patient ID and date of birth to verify your identity."
            ]
        },
        {
            "tag": "confirmupdate",
            "patterns": [
                "Yes, right. Want to know when it's done."
            ],
            "responses": [
                "Got it. I'll confirm with you as soon as the update is complete."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to change my emergency contact person."
            ],
            "responses": [
                "Certainly. I can help with that. Could you please provide your patient identification number and date of birth so I can access your records?"
            ]
        },
        {
            "tag": "confirmupdate",
            "patterns": [
                "Yes, correct. Need assurance it's changed."
            ],
            "responses": [
                "Of course. I will ensure it's updated and confirm with you immediately."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hi, want update emergency number contact"
            ],
            "responses": [
                "Hello. I can certainly help with that. To get started, can you please provide your patient ID and date of birth?"
            ]
        },
        {
            "tag": "confirmupdate",
            "patterns": [
                "Yes, right. Let me know final."
            ],
            "responses": [
                "Will do. Will confirm when updated."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to change who to call in emergencies, I am having trouble hearing."
            ],
            "responses": [
                "I understand. We can handle this over text chat to make it easier for you. Can you please give your patient ID and date of birth for verification?"
            ]
        },
        {
            "tag": "confirmupdate",
            "patterns": [
                "Yes, that's it. Please inform me when completed."
            ],
            "responses": [
                "Certainly. I will let you know as soon as the update is processed."
            ]
        },
        {
            "tag": "mentalhealthresourcelookup",
            "patterns": [
                "Hello, I'm feeling incredibly anxious lately and it's impacting my daily life. I'd like to explore options for mental health support."
            ],
            "responses": [
                "I understand you're experiencing anxiety. I'm sorry to hear that. To best assist you, could you please provide your patient ID or date of birth?"
            ]
        },
        {
            "tag": "mentalhealthresourcelookup",
            "patterns": [
                "Hello, I'm feeling incredibly anxious lately and it's impacting my daily life. I'd like to explore options for mental health support."
            ],
            "responses": [
                "I understand you're experiencing anxiety. I'm sorry to hear that. To best assist you, could you please provide your patient ID or date of birth?"
            ]
        },
        {
            "tag": "mentalhealthresourcelookup",
            "patterns": [
                "Hello, I'm feeling incredibly anxious lately and it's impacting my daily life. I'd like to explore options for mental health support."
            ],
            "responses": [
                "I understand you're experiencing anxiety. To best assist you, could you please provide your patient ID or date of birth?"
            ]
        },
        {
            "tag": "mentalhealthresourcelookup",
            "patterns": [
                "Hello, I'm feeling incredibly anxious lately and it's impacting my daily life. I'd like to explore options for mental health support."
            ],
            "responses": [
                "I understand you're experiencing anxiety. I'm sorry to hear that. To best assist you, could you please provide your patient ID or date of birth?"
            ]
        },
        {
            "tag": "mentalhealthresourcelookup",
            "patterns": [
                "Hello, I'm feeling incredibly anxious lately and it's impacting my daily life. I'd like to explore options for mental health support."
            ],
            "responses": [
                "I understand you're experiencing anxiety. I'm sorry to hear that. To best assist you, could you please provide your patient ID or date of birth?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Hey, I got a bill from you guys, and it's got a charge for a lab test I never even had. It's for like, two hundred bucks! I need someone to fix this."
            ],
            "responses": [
                "I understand you're disputing a charge on your bill. Can you please provide your patient ID and the date of service in question?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Yeah, that sounds good. I just don't want to pay for something I didn't get."
            ],
            "responses": [
                "I understand your frustration. I'll make sure the billing team knows the details. Can I confirm your phone number and email address for contact?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Hello, I need help with a bill I received. It includes a charge for a lab test I did not undergo. I am a bit confused."
            ],
            "responses": [
                "I understand. I can certainly look into that for you. Could you please provide your patient identification number and the date of service in question?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Sounds alright. Just get this sorted please, it's stressful to deal with these mistakes."
            ],
            "responses": [
                "I absolutely understand. I'll ensure the billing team is aware of your concerns. Can you confirm your phone number and email address so we can update you?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Yeah, I need to dispute a charge on my medical bill. It's for a lab test I didn't have. I can't believe they would try and get away with this."
            ],
            "responses": [
                "I understand you're disputing a charge. I can certainly help you with this. Can you give me your patient ID and the date you were seen?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Yeah, that's fine. Just get it taken care of. I work hard for my money, and I ain't gonna pay for something I didn't get."
            ],
            "responses": [
                "Absolutely! I'll ensure the billing team is aware of the situation. Can you please confirm your phone number and email address for us?"
            ]
        },
        {
            "tag": "recordstransferrequest",
            "patterns": [
                "Hi, I'm new to the city and need to transfer my medical records from my old hospital in Chicago."
            ],
            "responses": [
                "Welcome to our hospital! I can certainly help you with transferring your medical records. To start, could you please provide me with the name of your previous hospital and your date of birth?"
            ]
        },
        {
            "tag": "recordstransferrequest",
            "patterns": [
                "I need to move my records here from St. Luke's downtown.  I'm kinda stressed about it, hope it's easy."
            ],
            "responses": [
                "I understand your concern. I'll make the process as smooth as possible. Can you give me your full name, date of birth, and the full name and address of St. Luke's downtown?"
            ]
        },
        {
            "tag": "internationalrecordsrequest",
            "patterns": [
                "Guten Tag! I moved from Deutschland and need my Akte transferred."
            ],
            "responses": [
                "Willkommen! I can certainly help with that. Can you please provide the name of the Klinik and any patient ID you had there?"
            ]
        },
        {
            "tag": "recordstransferrequest",
            "patterns": [
                "Hello. I have recently relocated and require my health information to be moved from my previous healthcare provider to this facility."
            ],
            "responses": [
                "Certainly, I can assist you with that. To initiate the process, may I please have the name and location of your previous healthcare provider, as well as your date of birth?"
            ]
        },
        {
            "tag": "recordstransferrequest",
            "patterns": [
                "Hi. My doctor told me to transfer my records here. It's from City General."
            ],
            "responses": [
                "Okay, I can help you with that.  To get started, could you please provide your full name and date of birth, along with any patient ID number you had at City General?"
            ]
        },
        {
            "tag": "militaryrecordsrequest",
            "patterns": [
                "Hey, I need to get my records over here from the VA. It's kinda a hassle."
            ],
            "responses": [
                "I understand. Thank you for your service. We can definitely help transfer your records from the VA. Can you please provide your full name, date of birth, and the location of the VA hospital or clinic you were previously seen at?"
            ]
        },
        {
            "tag": "internationalrecordsrequest",
            "patterns": [
                "Hola, me mudé aquí desde México y necesito que me transfieran mi historial médico."
            ],
            "responses": [
                "¡Hola! Puedo ayudarle con eso. Para empezar, ¿podría proporcionarme el nombre del hospital en México y su fecha de nacimiento?"
            ]
        },
        {
            "tag": "outofstaterecordsrequest",
            "patterns": [
                "Hi, I need to transfer my records. I just moved here from out of state."
            ],
            "responses": [
                "Welcome! I can certainly assist you with transferring your medical records. To get started, could you please provide the name and city/state of your previous doctor's office or hospital?"
            ]
        },
        {
            "tag": "physicianreferral",
            "patterns": [
                "My PCP referred me. I need my files from her old office."
            ],
            "responses": [
                "Alright, I can help with that. To begin, could you provide your primary care physician's name and the name of her previous office?"
            ]
        },
        {
            "tag": "internalrecordstransfer",
            "patterns": [
                "I'm transferring from another clinic within this hospital system. It should be easy, right?"
            ],
            "responses": [
                "Yes, transferring records within our system is usually quite straightforward. To proceed, can you please confirm your full name, date of birth, and the name of the clinic you're transferring from?"
            ]
        },
        {
            "tag": "telehealthplatform",
            "patterns": [
                "Hi, I'd like to know if you offer virtual consultations. I think I might have the flu."
            ],
            "responses": [
                "Yes, we do offer virtual consultations. To schedule one, could you please provide your patient ID and insurance information?"
            ]
        },
        {
            "tag": "telehealthplatform",
            "patterns": [
                "My child has been vomiting for two days. Can I get a virtual appointment with a pediatrician?"
            ],
            "responses": [
                "I understand your concern. To book a virtual appointment, could you please provide your child's name, date of birth, and your insurance information?"
            ]
        },
        {
            "tag": "telehealthplatform",
            "patterns": [
                "I'm having trouble breathing and have a persistent cough. Can I schedule a telehealth appointment?"
            ],
            "responses": [
                "I understand. Difficulty breathing can be serious. Can you provide your patient ID and insurance details, and confirm your current location for emergency services if needed?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule my virtual appointment for next week. Is that possible?"
            ],
            "responses": [
                "Yes, rescheduling your virtual appointment is possible. Can you please provide your patient ID and the date and time of your current appointment?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I'd like to refill my prescription for my allergy medicine."
            ],
            "responses": [
                "Certainly. To refill your prescription, could you please provide your patient ID and the name of the medication?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "How can I update my address and phone number?"
            ],
            "responses": [
                "I can help with that. To update your information, please provide your patient ID and your new address and phone number."
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I need to find a specialist for my back pain. Who do you recommend?"
            ],
            "responses": [
                "I can help you find a specialist. Can you provide your insurance information so I can check for in-network providers?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I received a bill but I think there's an error. Can you help me with billing support?"
            ],
            "responses": [
                "I can certainly help with billing inquiries. Please provide your patient ID and the account number on the bill you're questioning."
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I lost my insurance card. Can you help me with insurance claim support?"
            ],
            "responses": [
                "Yes, I can assist you. Please provide your patient ID so I can verify your insurance details and guide you on obtaining a replacement card."
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "What is the status of my lab report from last week?"
            ],
            "responses": [
                "I can check that for you. Could you please provide your patient ID and the date the lab work was done?"
            ]
        },
        {
            "tag": "woundcareinstructionslookup",
            "patterns": [
                "Hello, I was recently discharged and I need to know what kind of wound care supplies I need for my surgery site at home. Also can I get them delivered?"
            ],
            "responses": [
                "Certainly! I can help you with that. Can you please provide your patient ID and confirm your address?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "My daughter needs a follow-up appointment with Dr. Smith, but I'm not sure when he's available."
            ],
            "responses": [
                "I can help with that. Could you please provide your daughter's name and date of birth?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I received a bill that seems incorrect. I think there may have been a mistake with my insurance."
            ],
            "responses": [
                "I understand. I can investigate this for you. Can you please provide your account number and insurance information?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hi, I am calling to find out the status of my lab reports."
            ],
            "responses": [
                "Sure. Can you please provide your name and date of birth to verify your identity?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Hello, I need a refill of my prescription for Lisinopril."
            ],
            "responses": [
                "Okay, I can help you with that. Can you please provide your patient ID and the name of the pharmacy you'd like to use?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to update my address in your system."
            ],
            "responses": [
                "Certainly, I can assist you with that. Could you please provide your name and date of birth for verification?"
            ]
        },
        {
            "tag": "cancelappointment",
            "patterns": [
                "I want to cancel my appointment with Dr. Lee."
            ],
            "responses": [
                "I can help you with that. Can you please provide your name and the date and time of the appointment?"
            ]
        },
        {
            "tag": "emergencycontact",
            "patterns": [
                "I need to get emergency contact information for my dad. He's currently admitted."
            ],
            "responses": [
                "I understand. I can provide that information. What is your dad's full name and date of birth?"
            ]
        },
        {
            "tag": "transfercall",
            "patterns": [
                "I want to speak with someone about my insurance claim."
            ],
            "responses": [
                "Certainly, I can connect you with our insurance claim support team. To ensure I route your call correctly, can you please provide your insurance provider and policy number?"
            ]
        },
        {
            "tag": "labtestbooking",
            "patterns": [
                "I would like to book a lab test. My doctor requested a blood panel."
            ],
            "responses": [
                "I can schedule that for you. Do you have a doctor's order, and what's your preferred date and time?"
            ]
        },
        {
            "tag": "travelclearanceformlookup",
            "patterns": [
                "Hello, I need to get travel clearance for my child who has asthma. We're flying to Florida next month and I understand there are some forms we need to fill out. Could you please help?"
            ],
            "responses": [
                "Certainly, I can help you with that. To start, can you provide your child's name and date of birth?"
            ]
        },
        {
            "tag": "travelclearanceformlookup",
            "patterns": [
                "I need to get a travel clearance form for my son, he's got bad asthma. We're flying to Colorado next week."
            ],
            "responses": [
                "Okay, I can help with that. To start, I'll need your son's name, date of birth, and medical record number, if you have it handy."
            ]
        },
        {
            "tag": "travelclearanceformlookup",
            "patterns": [
                "Hi, I need assistance with a travel clearance form for my daughter who suffers from asthma. We are going to California for vacation."
            ],
            "responses": [
                "Certainly. Let's get started with the necessary paperwork. Could you please provide your daughter's full name and her date of birth?"
            ]
        },
        {
            "tag": "travelclearanceformlookup",
            "patterns": [
                "Hello, I need to get travel clearance for my child. She is asthmatic, and we will be travelling to Arizona next month. Can you help me out with the paperwork?"
            ],
            "responses": [
                "Of course, I can guide you through that process. To begin, please provide your child's name, date of birth, and medical record number if you have it available."
            ]
        },
        {
            "tag": "travelclearanceformlookup",
            "patterns": [
                "Hi there, I need help obtaining a travel clearance form for my child. He has asthma, and we are flying to Texas."
            ],
            "responses": [
                "I can certainly assist you with that. Can you please provide your child's name and date of birth?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hi, I'm a transgender patient and I'd like to update my legal name and gender on my medical records. Could you guide me through the process?"
            ],
            "responses": [
                "Certainly. I can help you with that. To start, can you please provide me with your patient ID or date of birth so I can access your account?"
            ]
        },
        {
            "tag": "legalnamechange",
            "patterns": [
                "Hello, I need to change my name and gender on all my hospital records. I'm transgender and have the necessary legal documents."
            ],
            "responses": [
                "Okay, I understand. I can definitely assist you with that. First, could you please verify your date of birth and last four digits of your social security number for verification?"
            ]
        },
        {
            "tag": "gendermarkerchange",
            "patterns": [
                "Hi, I'm calling because I'm a trans woman, and I want to know what I need to do to get my name and gender changed on my medical records here."
            ],
            "responses": [
                "Thank you for calling. I can help you with that. Can I please get your full name and date of birth to locate your account?"
            ]
        },
        {
            "tag": "namechangeform",
            "patterns": [
                "Hi there, I recently transitioned and need to update my name and gender on my hospital records. What's the procedure?"
            ],
            "responses": [
                "Hello. I can certainly help with that. Could you please provide me with your name and date of birth to locate your account?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Bonjour. I have an appointment for physical therapy, but I need to change it. Parlez-vous anglais?"
            ],
            "responses": [
                "Yes, I speak English. I understand you need to reschedule your physical therapy appointment. Can you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, I need to reschedule an appointment. My back has been killing me."
            ],
            "responses": [
                "I'm sorry to hear about your back pain. I can help you reschedule your physical therapy appointment. May I have your name and patient ID number, please?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hi, I want to change my physical therapy appointment. My knee's been acting up lately."
            ],
            "responses": [
                "I'm sorry to hear that. Let's get that rescheduled for you. Can I get your name and date of birth please?"
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "Hi, I'd like to schedule a routine physical exam."
            ],
            "responses": [
                "Okay, I can help you with that. To get started, can you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "cancelappointment",
            "patterns": [
                "Hello, I need to cancel an appointment I have scheduled."
            ],
            "responses": [
                "I can help with that. Can you please provide your name and the date of the appointment you wish to cancel?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I received a bill that seems incorrect. Can someone help me?"
            ],
            "responses": [
                "I can assist with that. To investigate the billing issue, can you please provide your name and account number?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I need to find out if a doctor is in your network. Specifically, Dr. Emily Carter."
            ],
            "responses": [
                "I can help with that. Do you have your insurance information available so I can check?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need a refill for my prescription."
            ],
            "responses": [
                "Okay, I can help with that. Can you please provide your name, date of birth, and the prescription number?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to update my insurance information."
            ],
            "responses": [
                "Okay, I can assist with that. Can you please provide your name and date of birth to verify your identity?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "I have a question about my lab report results."
            ],
            "responses": [
                "I can help you with that. To access your lab report, can you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "emergencycontact",
            "patterns": [
                "I need to find the emergency contact number for the hospital."
            ],
            "responses": [
                "Sure, I can provide that. Which department are you trying to reach?"
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "I want to schedule a follow-up appointment with Dr. Jones."
            ],
            "responses": [
                "Okay, I can help you with that. Can you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "specialistreferral",
            "patterns": [
                "My daughter needs to see a pediatrician urgently. Can you help me find one?"
            ],
            "responses": [
                "Yes, I can help you find a pediatrician. What is your daughter's name and date of birth, and your insurance information?"
            ]
        },
        {
            "tag": "insuranceverification",
            "patterns": [
                "Hello, I need to know if my insurance covers physical therapy."
            ],
            "responses": [
                "I can check that for you. Could you please provide your name, date of birth, and insurance information?"
            ]
        },
        {
            "tag": "medicalrecordsrequest",
            "patterns": [
                "I need to get a copy of my medical records."
            ],
            "responses": [
                "Okay, I can help you with that. Could you please provide your name and date of birth for verification?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I need to file an insurance claim for a recent visit."
            ],
            "responses": [
                "Okay, I can assist you with that. Please provide your name, date of birth, and insurance information."
            ]
        },
        {
            "tag": "medicationinfolookup",
            "patterns": [
                "Can I get information about the side effects of a medication prescribed to me?"
            ],
            "responses": [
                "I can help you with that. Can you please provide your name, date of birth, and the name of the medication?"
            ]
        },
        {
            "tag": "contactinsurance",
            "patterns": [
                "I lost my insurance card. How can I get a new one?"
            ],
            "responses": [
                "I can help you with that. Please provide your name, date of birth, and insurance provider."
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule an appointment because of a family emergency."
            ],
            "responses": [
                "I'm sorry to hear that. I can help you reschedule. Can you please provide your name and the date of the original appointment?"
            ]
        },
        {
            "tag": "complaintfiling",
            "patterns": [
                "I want to file a complaint about the service I received."
            ],
            "responses": [
                "I'm sorry to hear you had a negative experience. I can help you file a complaint. Can you please provide your name and a brief description of the issue?"
            ]
        },
        {
            "tag": "preregistration",
            "patterns": [
                "I need to pre-register for an upcoming procedure."
            ],
            "responses": [
                "I can help you with that. Please provide your name, date of birth, and the date of your procedure."
            ]
        },
        {
            "tag": "specialistreferral",
            "patterns": [
                "How do I get a referral to see a specialist?"
            ],
            "responses": [
                "I can help guide you. First, do you have a primary care physician within our network?"
            ]
        },
        {
            "tag": "transportationassistance",
            "patterns": [
                "I need to arrange transportation to the hospital for my appointment."
            ],
            "responses": [
                "I can provide some information on transportation options. Are you looking for public transportation, a taxi service, or something else?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, I'm calling to see if I can move my appointment with Dr. Evans. My name is Earl Johnson, and my patient ID is 478921."
            ],
            "responses": [
                "Good morning, Mr. Johnson. I can certainly help you with that. Could you please confirm your date of birth?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule my appointment. Patient ID is 987654. It's with Dr. Chen."
            ],
            "responses": [
                "Okay, I can help with that. Can you please verify the date and time of your current appointment?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule. ID 123456. Appointment with Dr. Smith."
            ],
            "responses": [
                "I can assist you with that. To confirm, is your name John Doe?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, I have to change my appointment. My patient ID is 5551212."
            ],
            "responses": [
                "Certainly, I can assist with that. Can you please state your name?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to move my appointment with Dr. Lee. Patient ID 777888."
            ],
            "responses": [
                "Of course. Could you please tell me your name?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, I want to reschedule my cardiology appointment. My ID is 888999."
            ],
            "responses": [
                "Certainly. May I confirm your full name, please?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I'm calling about rescheduling my appointment. Number is 654321."
            ],
            "responses": [
                "Certainly, I can help you with that. May I please confirm your name?"
            ]
        },
        {
            "tag": "vaccinationschedulelookup",
            "patterns": [
                "Hola, buenos dias.  Necesito informacion... my hijo... vaccination... pediatric..."
            ],
            "responses": [
                "Buenos días. Entiendo que necesita información sobre el calendario de vacunación pediátrica para su hijo. Para ayudarle mejor, ¿podría proporcionarme su nombre y la fecha de nacimiento de su hijo?"
            ]
        },
        {
            "tag": "appointmentlookup",
            "patterns": [
                "Excuse me, I'm calling about my daughter's appointment.  I think it's next week, but I'm not sure of the day."
            ],
            "responses": [
                "Certainly. I can help you find that information. Can you please provide your daughter's name and date of birth?"
            ]
        },
        {
            "tag": "symptomchecker",
            "patterns": [
                "My son is running a fever, and I am not sure if I should take him to the emergency room. He also started vomiting a few hours ago."
            ],
            "responses": [
                "I understand your concern. To assist you, can you tell me your son's name, age, and temperature?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need a refill on my prescription. It's for... uh... metformin, I think."
            ],
            "responses": [
                "Okay, I can help with that. Can you please provide your name and date of birth, and confirm the medication name?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I got a bill from you guys, and I don't understand it.  It seems awfully high."
            ],
            "responses": [
                "I understand your concern. I can review your bill with you. Can you provide your name and account number?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hi, I'm calling to check the status of a COVID-19 PCR test I took two days ago."
            ],
            "responses": [
                "Okay, I can help with that. Can you please provide your lab order number and date of birth?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hello, I'd like to inquire about the status of my COVID test. I submitted it on Monday."
            ],
            "responses": [
                "Good morning! I can certainly help with that. Can I get your name and lab order number, please?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hi, I took a COVID test a couple days ago, and I haven't heard anything back. Can you check on it?"
            ],
            "responses": [
                "Certainly, I can look into that for you. Could you please provide the lab order number?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Yeah, hello. I'm calling about a COVID test result. I haven't gotten it yet."
            ],
            "responses": [
                "I understand. To assist you, I'll need some information. Do you have the lab order number available?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hi, I'm calling regarding my COVID-19 PCR test. It's been two days and I haven't received the results. My lab order number is..."
            ],
            "responses": [
                "Hello, I can assist you with that. Please provide the complete lab order number so I can look up the results."
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hello, I'm needing help with... how you say... reimbursement for my surgery.  It was... a month ago, yes?"
            ],
            "responses": [
                "Hello! I understand you're looking for help with reimbursement for your surgery.  To assist you better, could you please provide your patient ID and insurance information?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Excuse me, I want to know about my bill from last week's visit. It was quite high, I think."
            ],
            "responses": [
                "I understand you have a question about your recent bill. Can you please provide your patient ID or date of birth so I can locate your account?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hi, I need to reschedule my appointment with Dr. Ramirez. Something came up."
            ],
            "responses": [
                "I can certainly help you reschedule your appointment. Can you please provide your patient ID and the date of the appointment you wish to reschedule?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "Hello, I need to find a new primary care physician. My old one retired."
            ],
            "responses": [
                "I understand you're looking for a new primary care physician. Do you have any preferences, such as gender or specialty, or are you seeking a physician within a specific location?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I think I need a prescription refill for my blood pressure medicine."
            ],
            "responses": [
                "I understand you need a prescription refill. To proceed, can you provide your patient ID and the name of the medication?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to update my contact information. I moved recently."
            ],
            "responses": [
                "I can help with that. To update your contact information, can you please provide your patient ID and your new address?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "I need to know if my lab results are ready."
            ],
            "responses": [
                "I can check that for you. Can you please provide your patient ID and the date the lab work was done?"
            ]
        },
        {
            "tag": "transfercall",
            "patterns": [
                "Hi, I think I have a fever and a bad cough. I want to speak with a doctor."
            ],
            "responses": [
                "I understand you're feeling unwell and want to speak with a doctor. Do you want to book an appointment or would you like to speak to a nurse first?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I have a question about my insurance coverage for physical therapy."
            ],
            "responses": [
                "I can help you with that. Can you please provide your insurance information and patient ID?"
            ]
        },
        {
            "tag": "cancelappointment",
            "patterns": [
                "I need to cancel my appointment next week."
            ],
            "responses": [
                "I can assist you with cancelling your appointment. Can you please provide your patient ID and the date of the appointment?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Hello, I need some help with my bill. I think there is a mistake."
            ],
            "responses": [
                "I understand you believe there may be an error on your bill. To investigate, could you please provide your patient ID and the date of service in question?"
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "Hi, I need to make an appointment with a cardiologist."
            ],
            "responses": [
                "I can help you schedule an appointment with a cardiologist. Do you have a specific doctor in mind, or are you a new patient?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello, I need to report a change in my insurance information."
            ],
            "responses": [
                "I can assist you with updating your insurance information. Could you please provide your patient ID and the new insurance details?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I want to know more about a specific doctor, Dr. Jones."
            ],
            "responses": [
                "I can provide information about Dr. Jones. What specific information are you looking for?"
            ]
        },
        {
            "tag": "labtestbooking",
            "patterns": [
                "I need to book a lab test."
            ],
            "responses": [
                "I can help you with that. What kind of lab test do you need, and do you have a doctor's order?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hello. I need, how you say, to check status of claim. For the surgery."
            ],
            "responses": [
                "Hello. I understand you want to check the status of your insurance claim for your surgery. Can you provide your patient ID and insurance information please?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Excuse me, I am calling because I have a question about my bill from the hospital."
            ],
            "responses": [
                "Certainly. I can help with that. To access your billing information, could you please provide your patient ID or date of birth?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I am needing to move my appointment I have with Dr. Lee."
            ],
            "responses": [
                "Okay. I can help with rescheduling your appointment. Can you provide your patient ID and the date you are currently scheduled?"
            ]
        },
        {
            "tag": "transfercall",
            "patterns": [
                "Hello, I forgot password for patient portal."
            ],
            "responses": [
                "I can certainly help you reset your password. To verify your identity, can you provide your patient ID and date of birth?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "Hello. I need know about the medicine doctor prescribe."
            ],
            "responses": [
                "I can help with information about your prescription. What is the name of the medication and your patient ID?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Hi, I'm calling because I need a refill on my insulin, like, ASAP. I'm completely out!"
            ],
            "responses": [
                "I understand this is urgent. I can help you with that. Could you please provide me with some information to verify your prescription and expedite the refill?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Hello, I need a prescription refill. I'm running low on my metformin."
            ],
            "responses": [
                "I can assist you with that. To process your refill, I'll need a little information. Could you please provide your full name, date of birth, and patient ID number?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Listen, I need my Lantus refilled right now! I'm gonna have a problem if I don't get it sorted out."
            ],
            "responses": [
                "I understand your concern and I'll do my best to help. To get started, can you please provide your name and patient identification number?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Hey, I'm out of my Tresiba pen. I need a refill. What do I do?"
            ],
            "responses": [
                "I can definitely help you with that. First, can you please give me your full name and date of birth for verification?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Hi, I am calling about my prescription. I think it is due for a refill. It is for my diabetes."
            ],
            "responses": [
                "Hello, I can certainly help you with that. Can I please get your name and date of birth to locate your record?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello. I need to change my emergency contact person. Hard of hearing, please type clearly."
            ],
            "responses": [
                "Hello! I understand you need to update your emergency contact information. I will type clearly. To assist you, can you please provide your patient ID and the new emergency contact's name and phone number?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Need to update my emergency contact. Name is wrong on file."
            ],
            "responses": [
                "Hello! I can certainly help you with that. To proceed, could you please provide your patient ID and the correct name for your emergency contact?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Want to add my daughter as emergency contact. Can't hear well."
            ],
            "responses": [
                "Hello. I understand you want to add your daughter as an emergency contact. To do this I need some info, please provide your patient ID, your daughter's full name, and her phone number."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Need to remove old neighbor as contact. Not talking anymore."
            ],
            "responses": [
                "Hello! I can help with that. To remove your previous emergency contact, I need your patient ID. Could you please provide that?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Emergency contact died. Need to update ASAP. Please help."
            ],
            "responses": [
                "I understand this is urgent. I'm very sorry for your loss. To update your emergency contact, please provide your patient ID and the new contact's information (name and phone number)."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "My daughter changed her number. Need to update emergency contact."
            ],
            "responses": [
                "Okay, I can help you update your daughter's phone number. Please provide your patient ID and your daughter's new phone number."
            ]
        },
        {
            "tag": "policylookup",
            "patterns": [
                "Want to list two emergency contacts. Can I do that?"
            ],
            "responses": [
                "I understand you'd like to have two emergency contacts listed. Let me check our policy regarding multiple emergency contacts. Please provide your patient ID while I look into this."
            ]
        },
        {
            "tag": "verifypatientinfo",
            "patterns": [
                "Is my son listed as emergency contact? Forgot who I put."
            ],
            "responses": [
                "I can check that for you. Please provide your patient ID, and I'll confirm who is currently listed as your emergency contact."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I have a new cell phone number. Need to update that AND emergency contact. Confusing!"
            ],
            "responses": [
                "No problem, I can help you with both updates. First, please provide your patient ID. Then, give me your new cell phone number and the information for your new emergency contact (name and phone number)."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I'm deaf, using relay service. Need to update emergency contact. Can you understand me?"
            ],
            "responses": [
                "Yes, I understand you are using a relay service. Thank you for letting me know. I can certainly help you update your emergency contact. Please provide your patient ID and the information for your new emergency contact (name and phone number)."
            ]
        },
        {
            "tag": "mentalhealthresourcelookup",
            "patterns": [
                "Hi, I'm calling because I've been feeling really anxious lately and I'd like to explore mental health support options."
            ],
            "responses": [
                "I understand. I'm sorry to hear you're experiencing anxiety. I can help you explore mental health support options at our hospital. Are you currently a patient here?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, I need to reschedule my appointment with Dr. Lee. I have a scheduling conflict."
            ],
            "responses": [
                "I can help with that. Can you please provide me with your name and date of birth?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Hi, I'm calling to inquire about a bill I received. It seems higher than expected."
            ],
            "responses": [
                "I can help with that. Can you please provide your account number or patient ID?"
            ]
        },
        {
            "tag": "labtestbooking",
            "patterns": [
                "I need to book a lab test. My doctor gave me a referral."
            ],
            "responses": [
                "Certainly. I can help you with that. Do you have the referral information handy?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hi, I'm calling to see if my MRI report is ready."
            ],
            "responses": [
                "I can check that for you. Could I get your name and date of birth please?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to update my address on file. I recently moved."
            ],
            "responses": [
                "I can certainly help you with that. Can you please provide your full name and date of birth for verification?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I'm calling about a prescription refill for my blood pressure medication."
            ],
            "responses": [
                "I can assist you with that. Can you please provide your full name and date of birth?"
            ]
        },
        {
            "tag": "emergencycontact",
            "patterns": [
                "Hi, I need to find an emergency contact number for the hospital."
            ],
            "responses": [
                "Certainly. I can provide that for you. Are you trying to reach someone currently at the hospital?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I want to know more about Dr. Ramirez, a cardiologist at your hospital."
            ],
            "responses": [
                "I can help with that. What specific information are you looking for about Dr. Ramirez?"
            ]
        },
        {
            "tag": "mentalhealthresourcelookup",
            "patterns": [
                "I am looking for options for mental health support, specifically for postpartum depression."
            ],
            "responses": [
                "I understand. Postpartum depression can be very challenging. I can help you explore mental health support options. Are you a current patient at our hospital?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Hey, I got this bill from you guys, and there's a charge on it for a blood test, a complete blood count. I never had that test done."
            ],
            "responses": [
                "I understand you're disputing a charge for a complete blood count. Can I get your patient ID and date of birth to pull up your account?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I received a bill but I think there is an error. I was charged for an MRI I never had."
            ],
            "responses": [
                "I'm sorry to hear that. I can certainly help you with this. Could you please provide your patient ID and date of birth so I can access your billing information?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I got a bill for a COVID test. I'm not sure why I was charged for it. I believe my insurance should cover it."
            ],
            "responses": [
                "Okay, let me look into that for you. Can you please provide your patient ID and insurance information?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I received a bill for services I believe were already paid for. I sent a check in the mail last month."
            ],
            "responses": [
                "I'm sorry for the confusion. Let's check on that payment. Can you please provide your patient ID and the date you mailed the check?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I was billed for a consultation with Dr. Smith, but I only saw a nurse practitioner."
            ],
            "responses": [
                "I understand your concern about being billed for a consultation with a doctor when you saw a nurse practitioner. Can you provide your patient ID and the date of the visit in question?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I have a question about my bill. I had a procedure done, and the bill is much higher than I expected."
            ],
            "responses": [
                "I understand your concern about the cost of your procedure. To assist you, could you please provide your patient ID and the date of the procedure?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I need help with a bill. I was charged for a doctor's visit that I canceled."
            ],
            "responses": [
                "I'm sorry to hear you were charged for a canceled visit. I can look into that for you. Please provide your patient ID and the date of the scheduled appointment."
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I have a question about a bill. I think I was double-billed for something."
            ],
            "responses": [
                "I can help with that. Please provide your patient ID and the date(s) of service in question so I can look into it."
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I received a bill that is way too high for the services I received."
            ],
            "responses": [
                "I understand. I can review your bill for accuracy. Can I get your patient ID and the date of service?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Hello, I need assistance with a bill I recently received."
            ],
            "responses": [
                "Certainly, I can assist you. Please provide your patient ID and date of birth for verification."
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "Hi, I recently moved here and need to transfer my medical records from my old hospital. How do I do that?"
            ],
            "responses": [
                "Welcome! I can help you with that. To start, could you please provide the name and location of your previous hospital?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "I need my medical records sent here. I'm switching doctors."
            ],
            "responses": [
                "I understand. Could you please provide the name and address of your previous medical provider so we can request your records?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "I want to get my files from my old doctor transferred here."
            ],
            "responses": [
                "No problem. I can help you with that.  Can you give me the name of the doctor and their practice?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "Hi. I need to have my health records moved over to this hospital. I used to go to St. Elsewhere."
            ],
            "responses": [
                "Hello! I can assist you with that. First, could you confirm your full name and date of birth?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "I just moved and need to transfer my medical records from my previous doctor. It's a bit of a hassle, honestly."
            ],
            "responses": [
                "I understand. I can certainly help you with that. To get started, can you provide the name and address of your previous doctor's office?"
            ]
        },
        {
            "tag": "telehealthavailability",
            "patterns": [
                "Hi, I'm interested in scheduling a virtual consultation. Do you offer those? I'm feeling pretty rough with what I think is the flu."
            ],
            "responses": [
                "Yes, we do offer virtual consultations. To get started, could you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need to refill my prescription for Metformin. It's running low."
            ],
            "responses": [
                "I can help you with that. Can you please provide your name and date of birth to verify your account?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I think I was overcharged for a recent visit. Can someone look into my bill?"
            ],
            "responses": [
                "I can certainly help with that. Could you please provide your name and patient ID?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "My mom needs to update her emergency contact information. Can you help with that?"
            ],
            "responses": [
                "Yes, I can help with that. To update the information, I'll need your mom's name and date of birth, and who she would like to add as the emergency contact."
            ]
        },
        {
            "tag": "cancelappointment",
            "patterns": [
                "I need to cancel an appointment I have scheduled for next week."
            ],
            "responses": [
                "I can assist you with canceling your appointment. Can I get your name and date of birth to locate the appointment?"
            ]
        },
        {
            "tag": "dischargeinstructionslookup",
            "patterns": [
                "Hello, I was recently discharged after surgery and I'm a bit confused about the wound care instructions and where to get the supplies."
            ],
            "responses": [
                "Thank you for reaching out. I can certainly help you with that.  Could you please provide your patient ID so I can access your discharge information?"
            ]
        },
        {
            "tag": "dischargeinstructionslookup",
            "patterns": [
                "Hi, I need some information about my wound care after being released yesterday and how to get the supplies."
            ],
            "responses": [
                "I understand. I can look up your discharge instructions and arrange for home delivery of supplies. Can I please have your name and date of birth to locate your file?"
            ]
        },
        {
            "tag": "dischargeinstructionslookup",
            "patterns": [
                "I'm calling about the stuff I need for my wound. I got out of the hospital yesterday and they said something about getting it delivered."
            ],
            "responses": [
                "Yes, I can help you with that. Could you please provide your medical record number or date of birth so I can pull up your discharge information?"
            ]
        },
        {
            "tag": "dischargeinstructionslookup",
            "patterns": [
                "I was discharged yesterday and need assistance with obtaining the necessary wound care supplies."
            ],
            "responses": [
                "Certainly, I can assist you with that. To begin, may I have your full name and patient identification number, please?"
            ]
        },
        {
            "tag": "dischargeinstructionslookup",
            "patterns": [
                "Hello, I'm calling to inquire about the supplies for my at-home wound care. I was just discharged."
            ],
            "responses": [
                "I can certainly help you with that. To locate your discharge information, could you please provide your name and the date of your surgery?"
            ]
        },
        {
            "tag": "travelclearanceformlookup",
            "patterns": [
                "Hi, I'm planning a trip with my son, Timmy, and he has asthma. I heard I might need some special forms for him to travel. Can you help me figure out what I need?"
            ],
            "responses": [
                "Certainly! I can help you with that. To ensure I provide the correct information, could you please provide Timmy's date of birth and your insurance information?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule an appointment with Dr. Ramirez, but I'm not sure how to do it online."
            ],
            "responses": [
                "I can assist you with rescheduling your appointment. Could you please provide your name and date of birth for verification?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I received a bill that seems incorrect. I'd like to discuss it."
            ],
            "responses": [
                "I understand your concern. To access your billing information, can you please provide your account number?"
            ]
        },
        {
            "tag": "insuranceverification",
            "patterns": [
                "I need to find out if a certain doctor is in network with my insurance."
            ],
            "responses": [
                "I can check that for you. Could you provide the doctor's name and your insurance provider?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need to get a prescription refilled, but I don't know how."
            ],
            "responses": [
                "I can help with that. Please provide your name and the name of the medication."
            ]
        },
        {
            "tag": "emergencycontact",
            "patterns": [
                "I need to find the emergency contact information for the hospital."
            ],
            "responses": [
                "Certainly! What kind of emergency are you reporting?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I'd like to update my address on file."
            ],
            "responses": [
                "I can assist you with updating your address. To verify your identity, can you please provide your full name and date of birth?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I need to understand how to file an insurance claim for a recent surgery."
            ],
            "responses": [
                "I can provide information on filing an insurance claim. Could you please provide your insurance provider's name?"
            ]
        },
        {
            "tag": "labtestbooking",
            "patterns": [
                "I want to book a lab test for cholesterol and blood sugar. Can you help me with that?"
            ],
            "responses": [
                "I can certainly help you book those tests. Do you have a doctor's order for those tests, and what date would you like to schedule them?"
            ]
        },
        {
            "tag": "transfercall",
            "patterns": [
                "I need to transfer this call to the billing department, please."
            ],
            "responses": [
                "Okay, I can transfer you to the billing department. May I ask what the issue is?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello, I'm a transgender patient and I'd like to update my legal name and gender on my medical records. Can you help me with that?"
            ],
            "responses": [
                "Certainly! I can assist you with updating your legal name and gender on your medical records. To begin, could you please provide me with your patient ID?"
            ]
        },
        {
            "tag": "adminprocedurelookup",
            "patterns": [
                "Hi, I recently legally changed my name and gender, and I need to update my hospital records. What's the process?"
            ],
            "responses": [
                "I can definitely help you with that. To start, could you please provide your patient ID and the necessary documentation?"
            ]
        },
        {
            "tag": "confidentialitypolicylookup",
            "patterns": [
                "I had a legal name and gender marker change. How do I get my information updated here and how is it kept private?"
            ],
            "responses": [
                "Hello. I can assist you with updating your legal name and gender marker here. To proceed, do you have your patient ID and the relevant legal documentation available?"
            ]
        },
        {
            "tag": "genderupdateform",
            "patterns": [
                "Good morning. I want to make sure my records reflect my correct legal name and gender. I'm a transgender woman."
            ],
            "responses": [
                "Good morning. I understand. I can help you with that. Do you have your patient identification number available?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hi, I'm calling to ask about updating my name and gender on my records. I'm a trans man, and I've legally changed everything."
            ],
            "responses": [
                "Thank you for calling. I can assist you with that. To get started, may I have your patient ID number, please?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hola, buenos dias. I have an appointment for physical therapy, but I need to change it. I prefer to speak in Spanish."
            ],
            "responses": [
                "¡Hola! Entiendo. Let me help you reschedule your physical therapy appointment.  Could you please provide your patient ID or date of birth?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule my appointment. My name is John Smith."
            ],
            "responses": [
                "Okay Mr. Smith, I can help you with that. Can you please provide your date of birth or medical record number to locate your appointment details?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Yo, I gotta move my physical therapy appointment. It's kinda urgent."
            ],
            "responses": [
                "Alright, I can help you with rescheduling your appointment. To get started, can you give me your name and date of birth?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Excuse me, I'm calling about my physical therapy appointment. I need to move it, and I have a few specific needs."
            ],
            "responses": [
                "Certainly, I can assist you with rescheduling. Could you please provide your name and date of birth for verification?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Good morning. I need to reschedule my physical therapy. It's getting difficult for me to travel."
            ],
            "responses": [
                "Good morning. I can definitely help you with that. Can I please get your full name and date of birth?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to change my PT appointment. I'm old, and I need help getting there."
            ],
            "responses": [
                "I understand. I can assist you with rescheduling your physical therapy appointment and arrange transportation. Could you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hi, I have a physical therapy appointment, but I need to reschedule it. My English isn't the best, so please speak slowly."
            ],
            "responses": [
                "Hello, I understand you need to reschedule your appointment, and I will speak slowly and clearly. Can you please provide your name and date of birth so I can find your appointment?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Listen, I'm calling about my physical therapy appointment. I need to reschedule it, and I need a female therapist, got it?"
            ],
            "responses": [
                "Yes, I understand. I can help you reschedule and ensure you have a female therapist. Can you please provide your name and date of birth so I can locate your appointment?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, I would like to reschedule my physical therapy appointment."
            ],
            "responses": [
                "Certainly, I can assist you with that. May I please have your full name and date of birth?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hi, I need to change my physical therapy appointment. My eyesight is not what it used to be."
            ],
            "responses": [
                "Hello, I can certainly help you with rescheduling your appointment. Could you please provide your name and date of birth for verification?"
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "Hi, I'd like to schedule a routine physical check-up, please."
            ],
            "responses": [
                "Okay, I can help with that. Do you have your insurance information and preferred dates available?"
            ]
        },
        {
            "tag": "cancelappointment",
            "patterns": [
                "I need to cancel my appointment with Dr. Smith. Something came up."
            ],
            "responses": [
                "I'm sorry to hear that. Can I get your name and appointment date, please?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "My doctor told me to get a copy of my lab results. How do I do that?"
            ],
            "responses": [
                "Certainly. Can you please provide your patient ID or date of birth so I can locate your records?"
            ]
        },
        {
            "tag": "insuranceverification",
            "patterns": [
                "I lost my insurance card. Can you look up my information so I can give it to the pharmacy?"
            ],
            "responses": [
                "Of course. Can you provide your full name, date of birth, and address, please?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need a refill on my blood pressure medication."
            ],
            "responses": [
                "Okay, I can help with that. Can you provide your name and the name of the medication?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I'm having trouble paying my bill online. Can someone help me?"
            ],
            "responses": [
                "I understand. Can you please provide your account number or patient ID?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to update my address. I recently moved."
            ],
            "responses": [
                "Okay, I can assist you with that. Can you please provide your full name, date of birth, and your new address?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I need to get a referral to see a dermatologist."
            ],
            "responses": [
                "Okay, I can help you with that. Do you have a preferred dermatologist, or would you like me to find one in your network?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I think I need to go to urgent care, but I'm not sure where the closest one is in my network."
            ],
            "responses": [
                "I can certainly help you locate the nearest urgent care. Can I get your current address or zip code?"
            ]
        },
        {
            "tag": "transfercall",
            "patterns": [
                "My son has a fever and I'm not sure if I should take him to the emergency room."
            ],
            "responses": [
                "I understand your concern. What is your son's age and temperature?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, I need to reschedule my appointment with Dr. Adams. My name is Earl Johnson, and my patient ID is 487592."
            ],
            "responses": [
                "Good morning, Mr. Johnson. I can certainly help you with that. Can you please provide the date and time of your current appointment?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Yes, good morning. I need to check the status of some lab work that was done last week. My name is Martha Crane, ID 99887766."
            ],
            "responses": [
                "Good morning, Mrs. Crane. I can help with that. Can you tell me what kind of lab work was done, and approximately when?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "Hello, I'm calling to get information about a new doctor. I want to switch primary care physicians. My name is Robert Miller. ID is 1234567."
            ],
            "responses": [
                "Hello Mr. Miller, I can certainly assist with that. Are you looking for a particular speciality or have any preference for gender or location?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Good morning, I need a refill of my blood pressure medication. It's Lisinopril, and my name is Patricia Davis. ID 7890123."
            ],
            "responses": [
                "Good morning, Mrs. Davis. I can certainly look into that for you. Can you confirm the dosage of your Lisinopril prescription?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Hello, I'm calling about a bill I received. My name is George Wilson, patient ID 3456789."
            ],
            "responses": [
                "Hello Mr. Wilson, I can certainly help you with that. Could you please provide the bill number or the date of service in question?"
            ]
        },
        {
            "tag": "vaccinationschedulelookup",
            "patterns": [
                "Hola, buenas tardes. Necesito información sobre las vacunas para mi hijo. Él tiene cinco años."
            ],
            "responses": [
                "¡Hola! Buenas tardes. Entiendo que necesita información sobre el calendario de vacunación para su hijo de cinco años. ¿Puede proporcionarme su nombre y fecha de nacimiento, por favor?"
            ]
        },
        {
            "tag": "vaccinesideeffectsinfo",
            "patterns": [
                "Disculpe, mi niño tiene fiebre después de la vacuna. Es normal?"
            ],
            "responses": [
                "Entiendo que su niño tiene fiebre después de la vacuna. ¿Podría proporcionarme el nombre de la vacuna y la fecha en que se administró?"
            ]
        },
        {
            "tag": "vaccinationschedulelookup",
            "patterns": [
                "Hola, necesito saber cuándo es la próxima vacuna de mi hijo. Él tiene 4 años."
            ],
            "responses": [
                "Hola. Entiendo que necesita saber cuándo es la próxima vacuna de su hijo. ¿Podría proporcionarme su nombre completo y fecha de nacimiento, por favor?"
            ]
        },
        {
            "tag": "vaccinationrecordretrieval",
            "patterns": [
                "Buenas tardes, ¿me pueden ayudar? Necesito la tarjeta de vacunación de mi hija para la escuela."
            ],
            "responses": [
                "Buenas tardes. Entiendo que necesita la tarjeta de vacunación de su hija para la escuela. ¿Podría proporcionarme su nombre completo y fecha de nacimiento, por favor?"
            ]
        },
        {
            "tag": "vaccinebenefitsinfo",
            "patterns": [
                "Mi hijo no ha recibido la vacuna contra el sarampión. ¿Es muy importante?"
            ],
            "responses": [
                "Entiendo su preocupación sobre la vacuna contra el sarampión. Es muy importante para la salud de su hijo y la comunidad. ¿Tiene alguna pregunta específica sobre esta vacuna?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hi, I had a COVID-19 PCR test done two days ago and I'm wondering when I can expect the results. It's kind of important."
            ],
            "responses": [
                "Hello! I understand you're looking for the status of your COVID-19 PCR test. To assist you, can you please provide the lab order number and your insurance information?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I'm trying to find out about a bill I received from my recent ER visit."
            ],
            "responses": [
                "I can help with that. Can you please provide your full name, date of birth, and the account number from the bill?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule my appointment with Dr. Smith. Something came up."
            ],
            "responses": [
                "I understand. To reschedule your appointment, can you please provide your name and the date and time of your current appointment?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "My elderly mother needs a prescription refill for her blood pressure medication."
            ],
            "responses": [
                "I can assist with that. To refill your mother's prescription, I'll need her name, date of birth, and the name of the medication."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to update my contact information on file."
            ],
            "responses": [
                "I can help you with that. To update your contact information, can you please provide your name, date of birth, and the new contact information?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I'm looking for information about a specific doctor in your network, Dr. Eleanor Vance."
            ],
            "responses": [
                "I can help with that. What information about Dr. Vance are you looking for? For example, are you interested in her specialties, office location, or availability?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I have a question about my insurance claim."
            ],
            "responses": [
                "I can help with that. Can you please provide your name, date of birth, and the claim number?"
            ]
        },
        {
            "tag": "labtestbooking",
            "patterns": [
                "I need to book a lab test. My doctor ordered it."
            ],
            "responses": [
                "I can help with that. Do you have the order number from your doctor, along with your name and date of birth?"
            ]
        },
        {
            "tag": "transfercall",
            "patterns": [
                "I need to speak to someone about my bill. I don't understand the charges."
            ],
            "responses": [
                "I understand. I can transfer you to our billing department. Before I do, can you please provide your name, date of birth, and the account number on the bill?"
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "I think I need to book an appointment, I am having a bad headache for over a week now"
            ],
            "responses": [
                "I can help with that. To book an appointment, can you please provide your name, date of birth, and insurance provider?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hello, um, I need... help. I had surgery, yes? And I need to, uh, get money back from insurance. It's... difficult."
            ],
            "responses": [
                "Hello. I understand you need assistance with an insurance claim for your recent surgery. I can definitely help with that. To start, could you please provide your patient ID and insurance information?"
            ]
        },
        {
            "tag": "wayfindingassistance",
            "patterns": [
                "Excuse me, I am looking for Doctor Ramirez's office in building A. Could you please provide directions?"
            ],
            "responses": [
                "Certainly! I can help with that. Do you know which building number or floor it is on, or what his specialty is?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I received a bill for services I thought were covered by my insurance. Can you look into this for me?"
            ],
            "responses": [
                "I can definitely help with that. To investigate this billing issue, I'll need your patient ID and insurance information, please."
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "My son, David Miller, has an appointment tomorrow with Dr. Chen. Something came up, and we need to move it. Is that possible?"
            ],
            "responses": [
                "Yes, I can help with that. Let me pull up David Miller's appointment with Dr. Chen. Could you please confirm his date of birth?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Hi, I need to refill a prescription. It's for... um... Lisinopril."
            ],
            "responses": [
                "Okay, I can help you with that. Could you please provide your patient ID or date of birth?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Hello, my name is John Smith. I need to find out about a test I took last week. How do I check the status?"
            ],
            "responses": [
                "Hello Mr. Smith, I can help you check the status of your test. Can I have your date of birth and the type of test you had?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to update my address and phone number. I've moved recently."
            ],
            "responses": [
                "Okay, I can assist with that. To update your information, can I please verify your patient ID and date of birth?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Hi, I'm out of my insulin! Like, completely out. I need a refill ASAP!"
            ],
            "responses": [
                "I understand this is urgent. I can help with a prescription refill. To start, can you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need a refill of my insulin pen. It's urgent, I'm travelling tomorrow."
            ],
            "responses": [
                "I understand. Let's get that sorted right away. Could you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Umm, hi. My name is Emily and I kinda need my... you know... insulin stuff... refilled?"
            ],
            "responses": [
                "Hi Emily, I can definitely help with that. I understand you need your insulin refilled. Can you please provide your full name and date of birth?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Good morning, I am contacting you regarding a refill of my insulin prescription. I seem to have exhausted my current supply."
            ],
            "responses": [
                "Good morning. I understand you need a refill of your insulin. To assist you, may I have your full name and date of birth, please?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "Listen, I need my script refilled. My sugar's been high and I'm almost out of my medication. It's a real problem!"
            ],
            "responses": [
                "I understand your concern. Let's address this right away. Could you please provide your full name and date of birth?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello, I need to change my emergency contact. I'm having trouble hearing, so typing is easier for me."
            ],
            "responses": [
                "Hello! I can help you with that. To update your emergency contact information, I'll need to verify your identity. Can you please provide your patient ID and date of birth?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hi, I need to update the emergency contact on my account. Difficult to hear on phone."
            ],
            "responses": [
                "Certainly, I can assist you with updating your emergency contact information. To proceed, could you please provide your patient ID number and your full name?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello. I need change my emergency contact. Hearing not so good now, text better."
            ],
            "responses": [
                "Hello! I can certainly help you with updating your emergency contact information. To begin, please provide your medical record number and date of birth."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hi, I need to update my emergency contact info. Hard of hearing, prefer text."
            ],
            "responses": [
                "Hi there! No problem, I can help you with that. To start, can you please provide your patient identification number and zip code?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "Hello, I need to change my emergency contact person. Can't hear well on the phone."
            ],
            "responses": [
                "Hello! I understand you'd like to update your emergency contact. I can help with that. Can you please provide your health card number and address?"
            ]
        },
        {
            "tag": "mentalhealthresourcelookup",
            "patterns": [
                "Hi, I'm calling because I've been feeling increasingly anxious lately, and I'd like to explore my options for mental health support at your hospital."
            ],
            "responses": [
                "I understand. I'm sorry to hear you're experiencing anxiety. I can certainly help you explore mental health support options. Could you please provide your name and date of birth for verification?"
            ]
        },
        {
            "tag": "mentalhealthresourcelookup",
            "patterns": [
                "Hi, I'm calling because I've been feeling increasingly anxious lately, and I'd like to explore my options for mental health support at your hospital."
            ],
            "responses": [
                "I understand. I'm sorry to hear you're experiencing anxiety. I can certainly help you explore mental health support options. Could you please provide your name and date of birth for verification?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "Hi, I'm calling because I've been feeling increasingly anxious lately, and I'd like to explore my options for mental health support at your hospital."
            ],
            "responses": [
                "I understand. I'm sorry to hear you're experiencing anxiety. I can certainly help you explore mental health support options. Could you please provide your name and date of birth for verification?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "Hi, I'm calling because I've been feeling increasingly anxious lately, and I'd like to explore my options for mental health support at your hospital."
            ],
            "responses": [
                "I understand. I'm sorry to hear you're experiencing anxiety. I can certainly help you explore mental health support options. Could you please provide your name and date of birth for verification?"
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "Hi, I'm calling because I've been feeling increasingly anxious lately, and I'd like to explore my options for mental health support at your hospital."
            ],
            "responses": [
                "I understand. I'm sorry to hear you're experiencing anxiety. I can certainly help you explore mental health support options. Could you please provide your name and date of birth for verification?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Hey, I got a bill from you guys for a blood test, but I never had it done. The date on the bill is wrong too. What's going on?"
            ],
            "responses": [
                "I understand you're disputing a charge for a blood test. Can you provide your patient ID and date of birth so I can look into this for you?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I'm calling about a bill I received. I was charged for a service I believe was covered under my insurance. It was a follow up visit after ER visit."
            ],
            "responses": [
                "I can help with that. To assist you with this billing inquiry, could you please provide your patient ID and insurance information?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I need to dispute a bill. I think I was double-charged for an X-ray."
            ],
            "responses": [
                "I can certainly help with that. To start, can you please provide your patient ID and the date of the service in question?"
            ]
        },
        {
            "tag": "billinginvestigation",
            "patterns": [
                "I'm calling about a bill that I received, but I never authorized this procedure. I want to dispute it."
            ],
            "responses": [
                "I understand you're disputing a charge because you didn't authorize the procedure. Can you please provide your patient ID and the procedure code on the bill?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I need to understand this bill. It's way too high for just a regular checkup."
            ],
            "responses": [
                "I can certainly help you understand your bill. Can I please have your patient ID and date of birth for verification?"
            ]
        },
        {
            "tag": "billinginvestigation",
            "patterns": [
                "This bill is ridiculous! I was in the ER, and they're charging me for all kinds of things I didn't even get. I want to fight this."
            ],
            "responses": [
                "I understand your frustration. Let's take a look at this bill. Please provide your patient ID and the date of your ER visit."
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "Hi, I recently moved here and need to transfer my medical records from my old hospital. Can you help?"
            ],
            "responses": [
                "Certainly! I can assist you with transferring your medical records. To start, could you please provide me with your name and date of birth?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "I need to get my medical records transferred here. I just moved from out of state."
            ],
            "responses": [
                "Welcome! I can definitely help with that. Can you tell me your full name and date of birth to verify your identity in our system?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "Hello, I am calling to arrange for my medical records to be sent to this hospital. I have just relocated."
            ],
            "responses": [
                "Certainly, I can assist you with that. May I have your full name and date of birth, please?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "Hi, I need to have my records transferred here. I moved from another state last month."
            ],
            "responses": [
                "No problem, I can help you with that. First, I'll need to verify your identity. Could you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "I'm new to the area and I'd like to transfer my medical records here. Can you help me with that?"
            ],
            "responses": [
                "Yes, I can assist you with transferring your records. To begin, can I get your full name and date of birth?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "I just moved and need to get my medical records sent to this hospital. How do I do that?"
            ],
            "responses": [
                "I can help you with that. First, could you give me your full name and date of birth for verification?"
            ]
        },
        {
            "tag": "recordtransferrequest",
            "patterns": [
                "Good morning, I'm calling to have my medical records transferred to your facility as I've recently moved."
            ],
            "responses": [
                "Good morning. I can certainly help you with that. Could you please provide your full name and date of birth?"
            ]
        },
        {
            "tag": "telehealthavailability",
            "patterns": [
                "Hi, I'd like to know if you offer virtual consultations. I'm feeling pretty rough."
            ],
            "responses": [
                "Hello! Yes, we do offer virtual consultations. To assist you better, are you a registered patient with us?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule my appointment with Dr. Lee. Something came up at work."
            ],
            "responses": [
                "I understand. Could you please provide your patient ID and the date of your current appointment?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I'm trying to find a neurologist who specializes in migraines."
            ],
            "responses": [
                "Certainly. I can help with that. Do you have a preferred location or insurance provider?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need to refill my prescription for Lisinopril."
            ],
            "responses": [
                "Okay, I can help with that. Can you please provide your patient ID and the prescription number?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "I want to check the status of my lab report."
            ],
            "responses": [
                "Certainly. I can assist you with that. Can you please provide your patient ID and the date the lab tests were taken?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to update my address and phone number."
            ],
            "responses": [
                "I can help you with that. Could you please provide your patient ID?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I'm having trouble understanding my bill."
            ],
            "responses": [
                "I can help clarify that for you. Please provide your patient ID and the account number from the bill."
            ]
        },
        {
            "tag": "departmentinformation",
            "patterns": [
                "I need to find out the visiting hours for my mother in the ICU."
            ],
            "responses": [
                "I understand. Can you please provide your mother's name and date of birth for verification?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I have a question about my insurance claim."
            ],
            "responses": [
                "I can help with that. Could you please provide your patient ID and the claim number?"
            ]
        },
        {
            "tag": "labtestbooking",
            "patterns": [
                "I need to book a lab test for a cholesterol check."
            ],
            "responses": [
                "Certainly. I can schedule that for you. Do you have a preferred date and time?"
            ]
        },
        {
            "tag": "woundcareinstructionslookup",
            "patterns": [
                "Hello, I was recently discharged and I need information on wound care supplies. I don't think I received the list."
            ],
            "responses": [
                "Certainly! I can help you with that. Could you please provide your patient ID so I can retrieve your discharge information?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hi, I need to reschedule my appointment with Dr. Smith. Something came up."
            ],
            "responses": [
                "I can help with that. Could you provide your name and date of birth for verification?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "I'm calling to check the status of my lab report. It's been over a week."
            ],
            "responses": [
                "I understand. Could you please provide your medical record number or patient ID?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need to refill my prescription for Lisinopril. Can you help with that?"
            ],
            "responses": [
                "Yes, I can. Could you please provide your name and date of birth so I can verify your prescription?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to update my address and insurance information. I recently moved and changed insurance providers."
            ],
            "responses": [
                "I can assist you with updating your information. To begin, can you please provide your patient ID?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "I think I received the wrong bill. It's much higher than I expected."
            ],
            "responses": [
                "I understand. I can look into that for you. Can you please provide your account number or patient ID?"
            ]
        },
        {
            "tag": "cancelappointment",
            "patterns": [
                "I need to cancel my appointment with Dr. Lee on Friday."
            ],
            "responses": [
                "Okay, I can help you with that. May I have your name and date of birth, please?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I need to find out Dr. Chen's office hours for next week."
            ],
            "responses": [
                "I can certainly help you with that. One moment while I retrieve Dr. Chen's schedule."
            ]
        },
        {
            "tag": "emergencycontact",
            "patterns": [
                "I have an emergency and need to know the hospital's emergency contact information."
            ],
            "responses": [
                "I'm sorry to hear that. I can provide you with the emergency contact information immediately."
            ]
        },
        {
            "tag": "transfercall",
            "patterns": [
                "I keep getting transferred around, I need to speak to someone in billing regarding a claim."
            ],
            "responses": [
                "I apologize for the inconvenience. I can connect you directly to the billing department. Can I get your name please?"
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "My wound is infected, and the discharge instructions didn't cover what to do in this case."
            ],
            "responses": [
                "I understand. Could you describe the signs of infection you're observing, and provide your patient ID?"
            ]
        },
        {
            "tag": "paymenthistorylookup",
            "patterns": [
                "I received a bill that doesn't make sense. I believe I already paid this."
            ],
            "responses": [
                "I can check that for you. Could you provide your account number and the amount you believe you paid?"
            ]
        },
        {
            "tag": "medicationinstructionslookup",
            "patterns": [
                "My mother needs assistance with her blood pressure medication. She's confused about the dosage."
            ],
            "responses": [
                "I can help clarify the dosage. Could you provide your mother's name and date of birth?"
            ]
        },
        {
            "tag": "appointmentconfirmation",
            "patterns": [
                "I need to confirm that I am scheduled for a follow up next week."
            ],
            "responses": [
                "Certainly. I can help with that. Can you please state your full name and date of birth?"
            ]
        },
        {
            "tag": "emergencycontact",
            "patterns": [
                "I have severe chest pain and need help immediately. What should I do?"
            ],
            "responses": [
                "I understand this is an emergency. I can guide you. Where are you located?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I have a question regarding my insurance pre-authorization for surgery."
            ],
            "responses": [
                "I can help with that. Could you provide your insurance policy number and patient ID?"
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "I'm deaf. I need to communicate through text. I need assistance with scheduling an appointment"
            ],
            "responses": [
                "I understand. I will assist you via text. Please provide your name and date of birth."
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I would like to enroll in paperless billing."
            ],
            "responses": [
                "I can certainly help you with that. Can you confirm your email address?"
            ]
        },
        {
            "tag": "privacypolicyinformation",
            "patterns": [
                "I have a question about the privacy policy. I don't want my data shared."
            ],
            "responses": [
                "I understand your concern. Let me direct you to the privacy information."
            ]
        },
        {
            "tag": "dischargeinstructionsexplanation",
            "patterns": [
                "I'm calling on behalf of my elderly neighbor who needs help understanding her hospital discharge paperwork."
            ],
            "responses": [
                "I can assist with that. Do you have her permission to discuss her medical information?"
            ]
        },
        {
            "tag": "financialassistanceinformation",
            "patterns": [
                "I have a question about financial assistance programs offered by the hospital."
            ],
            "responses": [
                "Certainly, I can provide information about our financial assistance programs. Do you have your patient ID available?"
            ]
        },
        {
            "tag": "lostandfoundreport",
            "patterns": [
                "I need to report a lost item during my last visit."
            ],
            "responses": [
                "I'm sorry to hear that. I can help you report a lost item. Can you describe the item and when you last saw it?"
            ]
        },
        {
            "tag": "feedbacksubmission",
            "patterns": [
                "I want to provide feedback about the service I received during my recent hospital stay."
            ],
            "responses": [
                "We appreciate your feedback. I can direct you to the appropriate channels for providing comments."
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I want to schedule a lab test without a doctor's order."
            ],
            "responses": [
                "I understand, but some lab tests require a doctor's order. Which test are you trying to schedule?"
            ]
        },
        {
            "tag": "donotcalllistmanagement",
            "patterns": [
                "I keep getting spam calls from this hospital. How do I stop them?"
            ],
            "responses": [
                "I apologize for the inconvenience. Let me look into that for you. Can I get your phone number please?"
            ]
        },
        {
            "tag": "immunizationrecordrequest",
            "patterns": [
                "I need a copy of my immunization record for school."
            ],
            "responses": [
                "I can help you with that. Could you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to change my preferred pharmacy."
            ],
            "responses": [
                "I can assist you with changing your preferred pharmacy. What is your patient id?"
            ]
        },
        {
            "tag": "transportationarrangement",
            "patterns": [
                "I need to schedule transportation to my appointment next week."
            ],
            "responses": [
                "I can assist you with that. Do you have Medicaid or any other transportation assistance?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to add an authorized representative to my account."
            ],
            "responses": [
                "I can help you add an authorized representative. Please provide your patient ID."
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "I was bitten by an animal in the parking lot, and I am not feeling well."
            ],
            "responses": [
                "I am sorry to hear that! What animal bit you, and where on your body did it bite you?"
            ]
        },
        {
            "tag": "pharmacylocator",
            "patterns": [
                "Where is the nearest pharmacy open right now?"
            ],
            "responses": [
                "I can help with that. Can you tell me your current location or zip code?"
            ]
        },
        {
            "tag": "appointmenthistoryrequest",
            "patterns": [
                "Can I get a summary of all my past appointments?"
            ],
            "responses": [
                "Yes, I can provide that for you. Can you please provide your patient ID?"
            ]
        },
        {
            "tag": "insurancenetworkcheck",
            "patterns": [
                "I want to know if a specific doctor is in my insurance network."
            ],
            "responses": [
                "I can check that for you. What is the doctor's name and your insurance provider?"
            ]
        },
        {
            "tag": "passwordreset",
            "patterns": [
                "I'm having trouble accessing the patient portal."
            ],
            "responses": [
                "I can assist you with that. What error message are you receiving?"
            ]
        },
        {
            "tag": "findtravelclearanceform",
            "patterns": [
                "Hello, I need to get a travel clearance form for my son. He has asthma, and we're going on a trip next week. I'm not sure where to find the right form or what information I need."
            ],
            "responses": [
                "Okay, I understand. I can help you with that. To confirm, you need a travel clearance form for your son who has asthma. To start, could you please provide your son's name and date of birth?"
            ]
        },
        {
            "tag": "travelvaccinationinfo",
            "patterns": [
                "I need information about travel vaccinations for my children"
            ],
            "responses": [
                "I can help you with information on travel vaccinations for your child. To start, could you please provide your child's name and date of birth?"
            ]
        },
        {
            "tag": "recordtransfer",
            "patterns": [
                "How can I transfer my records from another hospital."
            ],
            "responses": [
                "Okay, I understand. I can help you with that. To start, do you know the name of the hospital you want to transfer the records from?"
            ]
        },
        {
            "tag": "namechangerequest",
            "patterns": [
                "Hello, I'm a transgender patient and I'd like to update my legal name and gender on my medical records. Can you help me with that?"
            ],
            "responses": [
                "Certainly. I can assist you with updating your legal name and gender on your medical records. To proceed, I'll need some information to verify your identity and guide you through the process."
            ]
        },
        {
            "tag": "genderchangerequest",
            "patterns": [
                "Hi, I recently legally changed my name and gender. I want to make sure that's reflected in all my hospital records. What steps do I need to take, and who should I talk to?"
            ],
            "responses": [
                "I understand. Updating your legal name and gender in our records is important. Let me guide you through the process and connect you with the appropriate department."
            ]
        },
        {
            "tag": "confidentialitypolicylookup",
            "patterns": [
                "I need to update my name and gender on my medical record. I recently transitioned and have all the legal documents. What's the process and how confidential is this?"
            ],
            "responses": [
                "Absolutely. Updating your records is crucial, and we take your privacy very seriously. I can explain the process and confidentiality protocols."
            ]
        },
        {
            "tag": "documentupload",
            "patterns": [
                "Hi, I'm calling to change my name and gender on my medical records. I'm transgender, and I've legally changed everything."
            ],
            "responses": [
                "Thank you for contacting us. I can definitely help you with updating your name and gender on your medical records. Let's get started."
            ]
        },
        {
            "tag": "medicalrecordspolicylookup",
            "patterns": [
                "I'm a patient here and have recently transitioned. I need to update my records with my correct name and gender. I want to know what the hospital's policy is on this."
            ],
            "responses": [
                "Certainly. I can provide you with information about our hospital's policy on updating medical records for transgender patients."
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, good afternoon. I need to reschedule my physical therapy appointment. I am Mrs. Elena Rodriguez. I would prefer a female therapist, and I need help with transportation, please."
            ],
            "responses": [
                "Good afternoon, Mrs. Rodriguez. I understand you would like to reschedule your physical therapy appointment, you prefer a female therapist, and you need transportation assistance. To verify your identity, could you please provide your patient identification number?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "Hello, I need to reschedule my appointment. I am Elena Rodriguez, I'd prefer a female therapist and I need help with transportation"
            ],
            "responses": [
                "Hello Mrs. Rodriguez. I understand you want to reschedule your appointment. You would also prefer a female therapist and require some transportation assistance. Can you confirm your ID please?"
            ]
        },
        {
            "tag": "bookappointment",
            "patterns": [
                "Hi, I'd like to schedule a physical exam."
            ],
            "responses": [
                "Okay, I can help you with that.  Do you have a preferred date or doctor?"
            ]
        },
        {
            "tag": "rescheduleappointment",
            "patterns": [
                "I need to reschedule my appointment with Dr. Lee. Something came up."
            ],
            "responses": [
                "I understand. Can you please provide your name and date of birth so I can access your appointment details?"
            ]
        },
        {
            "tag": "cancelappointment",
            "patterns": [
                "I need to cancel an appointment. I am not feeling well."
            ],
            "responses": [
                "I'm sorry to hear that you're not feeling well. Can you please provide your name and date of birth to locate your appointment?"
            ]
        },
        {
            "tag": "doctorinfolookup",
            "patterns": [
                "I think I need to find a cardiologist. I'm new to the city and don't know anyone."
            ],
            "responses": [
                "I can help you with that. Do you have any preferences for location or insurance?"
            ]
        },
        {
            "tag": "billingsupport",
            "patterns": [
                "Hi, I'm trying to understand a bill I received. It seems very high."
            ],
            "responses": [
                "I can help you with that. Can you please provide your name, date of birth, and the account number on the bill?"
            ]
        },
        {
            "tag": "emergencycontact",
            "patterns": [
                "Where do I go for emergencies?"
            ],
            "responses": [
                "Our emergency room is located at the main entrance of the hospital. Is this a current emergency?"
            ]
        },
        {
            "tag": "checkreportstatus",
            "patterns": [
                "Can you tell me when my MRI report will be ready?"
            ],
            "responses": [
                "Sure, I can check that for you. Can you give me your name and date of birth?"
            ]
        },
        {
            "tag": "updatepatientinfo",
            "patterns": [
                "I need to update my address and phone number in your system."
            ],
            "responses": [
                "Okay, I can assist you with that. Can you please provide your current address and phone number, as well as your date of birth for verification?"
            ]
        },
        {
            "tag": "insuranceclaimsupport",
            "patterns": [
                "I need help with an insurance claim. It was denied."
            ],
            "responses": [
                "I'm sorry to hear your claim was denied. Let's see what we can do. Can you provide your name, date of birth, and insurance information?"
            ]
        },
        {
            "tag": "labtestbooking",
            "patterns": [
                "I need to book a lab test for cholesterol."
            ],
            "responses": [
                "Okay, I can help you schedule that. Do you have a doctor's order for the test?"
            ]
        },
        {
            "tag": "prescriptionrefill",
            "patterns": [
                "I need a refill on my blood pressure medication."
            ],
            "responses": [
                "I can help with that. Please provide your name and date of birth."
            ]
        },
        {
            "tag": "insurancepreauthorization",
            "patterns": [
                "My doctor told me to get pre-authorization for a procedure. How do I do that?"
            ],
            "responses": [
                "I can help you with that. Let me get some information. Can you provide your insurance details, the procedure code, and your doctor's name?"
            ]
        },
        {
            "tag": "medicalrecordsrequest",
            "patterns": [
                "I need to get a copy of my medical records."
            ],
            "responses": [
                "I can help you with that. Can you please verify your name and date of birth?"
            ]
        },
        {
            "tag": "patientportalsupport",
            "patterns": [
                "I'm having trouble accessing the patient portal."
            ],
            "responses": [
                "I can help you with that. Can you please provide your name and date of birth?"
            ]
        },
        {
            "tag": "prescriptionauthorization",
            "patterns": [
                "I have a question about my prescription. The pharmacist said it needs a prior authorization."
            ],
            "responses": [
                "I can look into that for you. Can you provide your name, date of birth, and the name of the medication?"
            ]
        },
        {
            "tag": "insurancecoveragecheck",
            "patterns": [
                "I need to find out if a specific therapy is covered by my insurance."
            ],
            "responses": [
                "I can help you with that. To check your coverage, could you provide your insurance information, specifically the plan name and policy number, along with the name of the therapy you're inquiring about?"
            ]
        },
        {
            "tag": "triageassessment",
            "patterns": [
                "I am experiencing a lot of pain, and I need to speak with a doctor as soon as possible."
            ],
            "responses": [
                "I understand you're in pain.  Could you please describe the nature of the pain and its location? Also, what is your name and date of birth?"
            ]
        },{
		      "tag": "greeting",
		      "patterns": [
		        "Hi",
		        "Hey",
		        "How are you",
		        "Is anyone there?",
		        "Hello",
		        "Good day"
		      ],
		      "responses": [
		        "Hey :-)",
		        "Hello, thanks for visiting",
		        "Hi there, what can I do for you?",
		        "Hi there, how can I help?"
		      ]
    		},{
		      "tag": "goodbye",
		      "patterns": ["Bye", "See you later", "Goodbye"],
		      "responses": [
		        "See you later, thanks for visiting",
		        "Have a nice day",
		        "Bye! Come back again soon."
		      ]
		    },{
		      "tag": "thanks",
		      "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
		      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    		},{
				"tag": "greeting",
				"patterns": ["Hi", "Hello", "Hey", "Good morning", "Good afternoon"],
				"responses": ["Hello! How can I assist you today?", "Hi there! What can I do for you?", "Hey! How can I help you with your healthcare needs today?"]
				},
				{
				"tag": "goodbye",
				"patterns": ["Bye", "Goodbye", "See you later", "Take care"],
				"responses": ["Goodbye! Take care of your health.", "See you soon!", "Have a great day!"]
				},
				{
				"tag": "thanks",
				"patterns": ["Thanks", "Thank you", "Appreciate it", "Thanks a lot"],
				"responses": ["You're welcome!", "Happy to help!", "Anytime!"]
				},
				{
				"tag": "book_appointment",
				"patterns": [
				"I want to book an appointment",
				"Can I schedule a doctor's visit?",
				"I need to see a doctor",
				"Book an appointment for me"
				],
				"responses": [
				"Sure! Can you please provide your name and preferred date and time?",
				"Of course! Please share your name and the reason for your appointment."
				]
				},
				{
				"tag": "reschedule_appointment",
				"patterns": [
				"I want to reschedule my appointment",
				"Can I change my appointment time?",
				"I need to move my appointment"
				],
				"responses": [
				"No problem! Please tell me your current appointment details and your preferred new time.",
				"Sure! What date and time would you like to reschedule to?"
				]
				},
				{
				"tag": "cancel_appointment",
				"patterns": [
				"I want to cancel my appointment",
				"Cancel my doctor visit",
				"I can't make it to my appointment"
				],
				"responses": [
				"Got it. Could you please confirm the appointment youd like to cancel?",
				"Sure, I can help with that. Whats the date and time of your appointment?"
				]
				},
				{
				"tag": "check_symptoms",
				"patterns": [
				"I have a headache and fever",
				"Im not feeling well",
				"I feel dizzy and tired",
				"Can you tell me what this symptom means?"
				],
				"responses": [
				"Im not a doctor, but I can help you understand possible causes. How long have you been feeling this way?",
				"I recommend you book an appointment with a doctor to discuss your symptoms in detail."
				]
				},
				{
				"tag": "insurance_info",
				"patterns": [
				"Do you accept Blue Cross insurance?",
				"Which insurances do you take?",
				"Is my insurance covered?"
				],
				"responses": [
				"We accept most major insurance providers. Could you please share your providers name?",
				"Yes, we do accept Blue Cross and other major insurances. I can verify your coverage if youd like."
				]
				},
				{
				"tag": "working_hours",
				"patterns": [
				"What are your working hours?",
				"When are you open?",
				"Are you open on weekends?"
				],
				"responses": [
				"Our clinic is open from 8 AM to 6 PM, Monday through Friday.",
				"Were open on weekdays from 8 AM to 6 PM, and on Saturdays from 9 AM to 1 PM."
				]
				},
				{
				"tag": "emergency",
				"patterns": [
				"I have chest pain",
				"This is an emergency",
				"What should I do in an emergency?"
				],
				"responses": [
				"If this is a medical emergency, please call 3703 1116 or go to the nearest hospital immediately.",
				"Please contact emergency services right away. I can assist with scheduling a follow-up after you receive care."
				]
				},{
	            "tag": "greeting",
	            "patterns": ["Hi", "Hello", "Hey", "Good morning", "Good afternoon", "How are you?", "Greetings", "Whats up?", "Hi there", "Hello assistant"],
	            "responses": ["Hello! How can I assist you today?", "Hi there! What can I do for you?", "Hey! How can I help you with your healthcare needs today?"]
		        },
		        {
		            "tag": "goodbye",
		            "patterns": ["Bye", "Goodbye", "See you later", "Take care", "Talk to you soon", "Catch you later", "Have a nice day"],
		            "responses": ["Goodbye! Take care of your health.", "See you soon!", "Have a great day!"]
		        },
		        {
		            "tag": "thanks",
		            "patterns": ["Thanks", "Thank you", "Appreciate it", "Thanks a lot", "Many thanks", "Im grateful", "Thanks for your help"],
		            "responses": ["You're welcome!", "Happy to help!", "Anytime!"]
		        },
		        {
		            "tag": "working_hours",
		            "patterns": ["What are your working hours?", "When are you open?", "Are you open on weekends?", "When can I visit?", "Clinic schedule please"],
		            "responses": ["Our clinic is open from 8 AM to 6 PM, Monday through Friday.", "Were open on weekdays from 8 AM to 6 PM, and on Saturdays from 9 AM to 1 PM."]
		        },
		        {
		            "tag": "emergency",
		            "patterns": ["I have chest pain", "This is an emergency", "What should I do in an emergency?", "I think Im having a heart attack", "Severe bleeding"],
		            "responses": ["If this is a medical emergency, please call 3703 1116 or go to the nearest hospital immediately.", "Please contact emergency services right away. I can assist with scheduling a follow-up after you receive care."]
		        },
		        {
		            "tag": "appointment_booking",
		            "patterns": ["I need to book an appointment", "Can I schedule a visit?", "Book a doctor", "Id like to see a doctor", "How do I make an appointment?"],
		            "responses": ["Sure! Please provide your preferred date, time, and doctors name.", "Absolutely! I can help you schedule an appointment right away."]
		        },
		        {
		            "tag": "appointment_cancellation",
		            "patterns": ["Cancel my appointment", "I need to cancel", "How to cancel an appointment", "Delete my booking"],
		            "responses": ["Your appointment has been canceled. Would you like to reschedule it?", "Okay, Ive canceled it. Let me know if you want to book another time."]
		        },
		        {
		            "tag": "appointment_reschedule",
		            "patterns": ["Reschedule my appointment", "Can I change my appointment?", "Move my booking", "Change appointment time"],
		            "responses": ["Of course! Please provide the new date and time you prefer.", "No problem, when would you like to reschedule your appointment?"]
		        },
		        {
		            "tag": "symptom_check",
		            "patterns": ["I have a headache", "I feel dizzy", "I have a sore throat", "My stomach hurts", "I feel tired all the time"],
		            "responses": ["Im sorry to hear that. Could you describe your symptoms in more detail?", "Its best to book an appointment so a doctor can evaluate your symptoms."]
		        },
		        {
		            "tag": "insurance",
		            "patterns": ["Do you accept insurance?", "What insurance plans do you take?", "Is my insurance valid here?", "Can I pay with my health insurance?"],
		            "responses": ["Yes, we accept most major insurance providers.", "Please share your insurance companys name, and I can verify it for you."]
		        },
		        {
		            "tag": "doctor_availability",
		            "patterns": ["Is Dr. Smith available?", "Can I see Dr. Brown today?", "Which doctors are available now?", "Whos on duty today?"],
		            "responses": ["Let me check for you. Dr. Smith is available from 10 AM to 2 PM.", "Dr. Brown has open slots this afternoon."]
		        },
		        {
		            "tag": "test_results",
		            "patterns": ["When will I get my test results?", "Are my lab results ready?", "How can I check my test results?"],
		            "responses": ["Test results are usually ready within 24-48 hours.", "You can check your test results through our patient portal or by calling the lab."]
		        },
		        {
		            "tag": "billing",
		            "patterns": ["I have a billing question", "How can I pay my bill?", "Can I pay online?", "What payment methods do you accept?"],
		            "responses": ["You can pay your bill online, by phone, or at the front desk.", "We accept cash, credit cards, and most insurance payments."]
		        },
		        {
		            "tag": "location",
		            "patterns": ["Where is your clinic located?", "Whats your address?", "How can I get to the hospital?", "Send me your location"],
		            "responses": ["Were located at 23 Main Street, Port-au-Prince.", "Our address is 23 Main Street, Port-au-Prince  next to the National Bank."]
		        },
		        {
		            "tag": "opening_days",
		            "patterns": ["Are you open on Sundays?", "Do you work on holidays?", "When are you closed?"],
		            "responses": ["Were closed on Sundays and public holidays.", "Our clinic operates Monday through Saturday."]
		        },
		        {
		            "tag": "doctor_specialization",
		            "patterns": ["Do you have a cardiologist?", "Can I see a pediatrician?", "I need a dermatologist", "What kind of doctors are available?"],
		            "responses": ["Yes, we have specialists in cardiology, pediatrics, dermatology, and more.", "Please tell me what type of doctor you need, and Ill assist you."]
		        },
		        {
		            "tag": "prescription_refill",
		            "patterns": ["I need a refill for my prescription", "Can I renew my medication?", "How to get more pills?", "Refill my drugs"],
		            "responses": ["Sure, I can help with that. Which medication would you like to refill?", "Please provide your prescription ID or doctors name."]
		        },
		        {
		            "tag": "vaccination",
		            "patterns": ["Do you provide vaccines?", "Can I get vaccinated there?", "I want a flu shot", "Do you have COVID-19 vaccines?"],
		            "responses": ["Yes, we offer flu, COVID-19, and other vaccines. Please book an appointment for vaccination.", "Vaccines are available Monday to Friday from 9 AM to 4 PM."]
		        },
		        {
		            "tag": "feedback",
		            "patterns": ["I want to leave feedback", "Can I rate my experience?", "Id like to give feedback", "How can I share my opinion?"],
		            "responses": ["We appreciate your feedback! Please share your thoughts about your experience.", "Thank you for helping us improve our services!"]
		        },
		        {
		            "tag": "mental_health",
		            "patterns": ["I feel anxious", "Im depressed", "Can I speak to a psychologist?", "I have stress issues"],
		            "responses": ["Youre not alone. We have qualified mental health professionals who can help.", "Would you like me to connect you with a psychologist?"]
		        },
		        {
		            "tag": "diet_nutrition",
		            "patterns": ["Can you give me a diet plan?", "I want to lose weight", "Whats a healthy diet?", "What should I eat to stay healthy?"],
		            "responses": ["Our nutritionists can create a personalized diet plan for you.", "Eating balanced meals with vegetables, proteins, and fruits is key to good health."]
		        },
		        {
		            "tag": "general_health_tips",
		            "patterns": ["Give me a health tip", "How can I stay healthy?", "Any advice for better health?", "How do I boost my immune system?"],
		            "responses": ["Stay hydrated, sleep 78 hours, and exercise regularly.", "Eat well, manage stress, and get regular checkups."]
		        },
		        {
		            "tag": "symptom_fever",
		            "patterns": ["I have a fever", "My temperature is high", "I feel hot and weak"],
		            "responses": ["Try to rest, drink fluids, and take acetaminophen if needed. If fever persists, consult a doctor."]
		        },
		        {
		            "tag": "symptom_cough",
		            "patterns": ["I have a cough", "I cant stop coughing", "Im coughing a lot"],
		            "responses": ["Is it a dry or wet cough? If it lasts more than a week, please see a doctor."]
		        },
		        {
		            "tag": "symptom_cold",
		            "patterns": ["I have a cold", "I feel congested", "My nose is running"],
		            "responses": ["It sounds like a cold. Stay hydrated and rest well. If symptoms persist, consult a physician."]
		        },
				{
				"tag": "feedback",
				"patterns": [
				"I want to leave feedback",
				 "Can I rate my experience?",
				 "Id like to give feedback"
				 ],
				 "responses": [
				 "We appreciate your feedback! Please share your thoughts about your experience.",
				 "Thank you for taking the time to give feedback  it helps us improve our services!"
				 ]
				 },{
			    "tag": "bookappointment",
			    "patterns": [
			      "I'd like to make an appointment with a doctor.",
			      "Can I book a check-up for next week?",
			      "I need to schedule a medical consultation.",
			      "Please help me set an appointment with a physician.",
			      "Can I arrange a visit for tomorrow morning?",
			      "I want to see Dr. Smith this Friday.",
			      "Book a doctor appointment for me.",
			      "How can I schedule an appointment?",
						      "I'd like to meet a doctor soon."
			    ],
			    "responses": [
			      "Sure! Please provide your preferred date and time for the appointment.",
			      "Of course, I can help you with that. What day works best for you?",
			      "Let's book your appointment. Could you tell me the department or doctor?",
			      "Got it! Please share your full name and contact number to confirm the appointment."
			    ]
			  },
			  {
			    "tag": "emergencycontact",
			    "patterns": [
			      "I need emergency medical help.",
			      "Who should I call in case of an emergency?",
			      "This is an emergency, what should I do?",
			      "Give me the emergency hotline number.",
			      "Can I talk to emergency support now?",
			      "It's urgent, I have severe pain.",
			      "Someone fainted, please help!",
			      "How do I contact emergency services?",
			      "Call for help immediately!"
			    ],
			    "responses": [
			      "If this is a medical emergency, please dial 911 or go to the nearest hospital immediately.",
			      "For emergencies, contact our emergency hotline at 3703 1116.",
			      "Your safety comes first! Please reach out to the nearest emergency center right now."
			    ]
			  },
			  {
			    "tag": "transfercall",
			    "patterns": [
			      "Please transfer me to another department.",
			      "Can you connect me with billing?",
			      "I need to speak to a nurse.",
			      "Transfer my call to the reception desk.",
			      "Connect me to a doctor, please.",
			      "Can you redirect me to insurance support?",
			      "I want to talk to the pharmacy team.",
			      "Send my call to the front desk.",
			      "Can you switch my call to medical support?"
			    ],
			    "responses": [
			      "Sure, Ill transfer your call to the requested department.",
			      "Please hold on a moment while I connect you to the right team.",
			      "Okay! Redirecting your call to the department now."
			    ]
			  },
			  {
			    "tag": "vaccinationschedulelookup",
			    "patterns": [
			      "When is the next vaccination date?",
			      "I want to check the vaccination schedule.",
			      "What vaccines are available this week?",
			      "Can you tell me when flu shots are given?",
			      "Id like to know the vaccination schedule.",
			      "Is the COVID-19 vaccine available today?",
			      "When can I book a vaccine appointment?",
			      "Please share the vaccination timings.",
			      "How can I find the next vaccination slot?"
			    ],
			    "responses": [
			      "Our vaccination center operates from 9 AM to 4 PM, Monday to Friday.",
			      "You can check the latest vaccination schedule on our website or call our vaccine desk.",
			      "We currently offer flu and COVID-19 vaccines  would you like to book a slot?"
			    ]
			  },
			  {
			    "tag": "vaccinesideeffectsinfo",
			    "patterns": [
			      "What are the side effects of the COVID-19 vaccine?",
			      "Do vaccines cause fever or fatigue?",
			      "Is it normal to feel dizzy after vaccination?",
			      "What should I do if I get a rash after the vaccine?",
			      "Tell me the possible side effects of flu shots.",
			      "Can I take painkillers after a vaccine?",
			      "What symptoms should I watch for after vaccination?",
			      "Are vaccines safe for children?"
			    ],
			    "responses": [
			      "Mild fever, fatigue, and soreness at the injection site are common and usually go away within 12 days.",
			      "If you experience severe symptoms, please contact your healthcare provider immediately.",
			      "Most vaccine side effects are mild and short-lived."
			    ]
			  },
			  {
			    "tag": "recordtransferrequest",
			    "patterns": [
			      "I want to transfer my medical records.",
			      "Can you send my records to another hospital?",
			      "How can I share my health report with another doctor?",
			      "I need my medical history forwarded to another clinic.",
			      "Please move my records to a different facility.",
			      "Can I get a copy of my medical records?",
			      "Transfer my report to Dr. Lee.",
			      "I want to request a health record transfer."
			    ],
			    "responses": [
			      "Sure! Please provide the destination clinics details and authorization for record transfer.",
			      "Your request will be processed within 48 hours after confirmation.",
			      "We can securely transfer your records once we verify your identity."
			    ]
			  },
			  {
			    "tag": "telehealthavailability",
			    "patterns": [
			      "Do you offer telehealth consultations?",
			      "Can I talk to a doctor online?",
			      "Is telemedicine available now?",
			      "How can I book a virtual appointment?",
			      "Do you provide video consultations?",
			      "Can I get medical advice remotely?",
			      "Are your telehealth services open today?",
			      "I prefer an online consultation, is that possible?"
			    ],
			    "responses": [
			      "Yes! We offer telehealth appointments via our secure video platform.",
			      "Virtual consultations are available from 8 AM to 6 PM, Monday through Friday.",
			      "Would you like me to help you schedule an online appointment?"
			    ]
			  },
			  {
			    "tag": "confidentialitypolicylookup",
			    "patterns": [
			      "Where can I read your privacy policy?",
			      "Do you share my medical information with others?",
			      "Is my health data kept confidential?",
			      "Tell me about your confidentiality policy.",
			      "How do you protect patient information?",
			      "Whats your data protection policy?",
			      "Can you assure me my information is private?"
			    ],
			    "responses": [
			      "We strictly adhere to patient privacy laws. Your data is encrypted and securely stored.",
			      "You can review our confidentiality policy on our website under Patient Privacy.",
			      "Your information is 100% confidential and shared only with authorized staff."
			    ]
			  },
			  {
			    "tag": "pediatricvaccinationschedulelookup",
			    "patterns": [
			      "When should my baby get vaccines?",
			      "Can you tell me the vaccination schedule for infants?",
			      "What shots are required for children?",
			      "Is there a vaccine plan for toddlers?",
			      "When is the next child vaccination due?",
			      "Id like to check my kids vaccination schedule.",
			      "What are the recommended vaccines for children under 5?",
			      "Do you provide pediatric immunization schedules?"
			    ],
			    "responses": [
			      "Yes, we offer pediatric vaccination schedules. Would you like me to list them?",
			      "Your child should receive key vaccines at 2, 4, 6, 12, and 18 months  confirm with your pediatrician.",
			      "We can provide a detailed vaccination plan based on your childs age."
			    ]
			    }
				]
				}
			    